{"Version":425001,"Days":[{"Id":1,"Date":"\/Date(1396648800000)\/"}],"Rooms":[{"Id":1,"Code":"004 (88)"},{"Id":2,"Code":"001 (90)"},{"Id":3,"Code":"015 (117)"},{"Id":4,"Code":"018 (156)"},{"Id":5,"Code":"016 (252)"},{"Id":6,"Code":"005 (265)"},{"Id":7,"Code":"046 (372)"},{"Id":8,"Code":"H-O Lab"}],"Speakers":[{"Id":28,"FirstName":"Miroslav","LastName":"Gavrilov","Bio":"\u003cp\u003eBorn in 1987, in Kikinda. Always knew he would be a programmer although people had several vivid ideas about some other professions. Got a bachelor\u0026#39;s degree in computer sciences at the University of Novi Sad. Worked in software and web development for years, all the while only wanting to do games. A polyglot in programming languages, he tries to find the uniqueness of every syntax, framework and engine he comes across. Currently mostly engaged in \u003cstrong\u003enode.js\u003c/strong\u003e (and \u003cstrong\u003ejavascript \u003c/strong\u003ein general), using \u003cstrong\u003eUnity\u003c/strong\u003e and \u003cstrong\u003eHaxePunk\u003c/strong\u003e to make games and enjoying various \u003cstrong\u003emongodb\u003c/strong\u003e shenenigans.\u003c/p\u003e\r\n\r\n\u003cp\u003eTwo years ago, he founded\u0026nbsp;\u003cstrong\u003ePixelablaze\u003c/strong\u003e, a (one-man) company that\u0026#39;s doing its best to change how Serbia does game development and design. He has been a part of the game development scene of Belgrade for about a year, being a part of the organization behind several social events including the \u003cstrong\u003eIndie Speed Run \u003c/strong\u003eand \u003cstrong\u003eGlobal Game Jam 2014\u003c/strong\u003e.\u003c/p\u003e\r\n\r\n\u003cp\u003eEnjoys playing \u003cstrong\u003eNethack\u003c/strong\u003e, \u003cstrong\u003eBanner Saga Factions\u003c/strong\u003e, \u003cstrong\u003eBastion\u003c/strong\u003e. Probably holds some record in speed-running \u003cstrong\u003eAladdin\u003c/strong\u003e.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/28.jpg","Company":"Pixelablaze"},{"Id":37,"FirstName":"Dalibor","LastName":"Milovanović","Bio":"\u003cp\u003eDalibor Milovanovic, administrator baza podata specijalista u Banci Intesa Beograd.\u003c/p\u003e\r\n\r\n\u003cp\u003eBazama podata se intenzivno bavi 10 godina.\u0026nbsp;Svoje znanje i iskustvo stekao je na migraciji, optimizaciji i praćenju performansi velikog broja SQL servera.\u0026nbsp;Poslednjih nekoliko godina bavi se i razvojem monitoring alata koji se mogu koristiti za centralizovanu administraciju kako samog database engina, tako i pratećih SSAS, SSIS i SSRS servisa.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/37.jpg","Company":"Banca Intesa Beograd"},{"Id":55,"FirstName":"Miloš","LastName":"Stefanović","Bio":"\u003cp\u003eMilo\u0026scaron; Stefanović je diplomirao na smeru za informacione sisteme Fakulteta organizacionih nauka u Beogradu diplomskim radom u oblasti ERP sistema. Ima\u0026nbsp;8 godina iskustva u implementaciji ERP sistema. Zaposlen je u kompaniji NPS Beograd najpre na poziciji ERP developer, potom kao Team liedera razvojnog tima za Dynamics NAV, a trenutno je na poziciji Direktora razvoja.\u003c/p\u003e\r\n\r\n\u003cp\u003eMilo\u0026scaron; je Microsoft Certified IT Professional for Microsoft Dynamics NAV i aktivno je učestvovao na velikom broju lokalnih, regionalnih i međunarodnih projekata implementacije Microsoft Dynamics NAV re\u0026scaron;enja u svojstvu\u0026nbsp; programera, analitičara sistema i vođe projekta. Njegova porofesionalna interesovanja su vezana za integraciju ERP sistema sa externim aplikacijama, FIT/GAP analizu poslovnih procesa i management.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/55.jpg","Company":"NPS d.o.o."},{"Id":1053,"FirstName":"Desnica","LastName":"Nina","Bio":"\u003cp\u003eNina Desnica je student četvrte godine, \u0026nbsp;na smeru informacioni sistemi i tehnologije, Fakulteta organizacionih nauka, Univerziteta u Beogradu. Pored toga član je upravnog odbora udruženja studenata informatike FONIS. Od 2013 godine jedna je od Microsoft Student Partnera u Microsoft centru Srbija.\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1053.jpg","Company":"Fonis"},{"Id":34,"FirstName":"Janko","LastName":"Jovanović","Bio":"\u003cp\u003eMore than 20 years of experience in crafting software products. Started as a developer in early \u0026#39;90, and shifted to design over the time.\u003c/p\u003e\r\n\r\n\u003cp\u003eWorking for more than 10 years as UI designer, of which last 5 years as an interaction designer. Currently running a small design agency focused solely on user experience design for Web, mobile and desktop software as well as kiosk/POS devices.\u003c/p\u003e\r\n\r\n\u003cp\u003eContributed to Smashing Book 2 with the chapter \u0026quot;Sketching, Wireframing and Prototyping\u0026quot;. Running a blog about design www.jankoatwarpspeed.com. Speaking at conferences in the region.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/34.jpg","Company":"Studio at Warp Speed"},{"Id":15,"FirstName":"Predrag","LastName":"Jelesijević","Bio":"\u003cp\u003ePredrag Jelesijević radi u Računskom centru Elektrotehničkog fakulteta u Beogradu gde je poslednjih 7 godina na poziciji sistem administratora i predavača u Мicrosoft akademiji Elektrotehničkog fakulteta. Jedan je od lead-ova ITPro Serbia korisničke grupe i sa kolegama koordinira rad Microsoft community-ja u Srbiji. Microsoft mu je ove godina dodelio status Most Valuable Professional \u0026ndash; MVP, a nosilac je i velikog broja tehničkih certifikata. Po struci je dip. ing. Elektrotehnike.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/15.jpg","Company":"Računski centar Elektrotehničkog fakulteta u Beogradu"},{"Id":10,"FirstName":"Nenad","LastName":"Trajkovski","Bio":"\u003cp\u003eRođen davnih godina pro\u0026scaron;log stoljeća u Zagrebu. Radim kao voditelj projekata u Perpetuum Mobile d.o.o. i kao trener za upravljanje projektima i MS PROJECT. Nekoliko puta nagrađivan kao najbolji predavač na regionalnim konferencijama. Certifikati: PMP, PMI-RMP, MCT, MCP, MCTS - Project i MVP - Project. U slobodno vrijeme pjevam u kupaoni operne arije i gledam kroz prozor.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/10.jpg","Company":"Perpetuum Mobile d.o.o."},{"Id":7,"FirstName":"Ivan","LastName":"Pavlović","Bio":"\u003cdiv\u003eIvan Pavlović (MVP for ALM, Certified ScrumMaster) se duže od 15 godina profesionalno bavi razvojem softvera. U tom periodu učestvovao je na raznim projektima počev\u0026scaron;i od konfiguracije i postavljanja razvojnih okruženja, obuke programera do razvoja gotovo svih tipova re\u0026scaron;enja na .NET platformi i SQL Serveru.\u003c/div\u003e\r\n\r\n\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\r\n\r\n\u003cdiv\u003eTrenutna zaduženja na projektima su mu definisanje poslovnih zahteva, dizajn arhitekture aplikacija, obuka timova za upotrebu automatskih testova i vođenje softverskih projekata upotrebom Scrum/Kanban tehnika. Pored toga, bavi se implementacijom, prilagođavanjem i obukom korisnika za rad sa Team Foundation Server-om.\u003c/div\u003e\r\n\r\n\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\r\n\r\n\u003cdiv\u003eRedovno učestvuje kao predavač na Microsoft konferencijama u zemlji i svetu. \u0026nbsp;Veoma je aktivan u Microsoft zajednici u Srbiji. Osnovao je .NET korisničku grupu decembra 2007. a od aprila 2013 koordini\u0026scaron;e rad Application Lifecycle Management (ALM) korisničke grupe.\u003c/div\u003e\r\n","PictureUrl":"Content/Images/Speakers/7.jpg","Company":"Hive Studios"},{"Id":42,"FirstName":"Ljubica","LastName":"Jovanović","Bio":"\u003cp\u003eAlthough Ljubica is considered a decent architect from a fine architectural family, she declares herself as a video game designer. Architecture was missing a plot. She was a 3D modeller/animator, but she wanted to create interactive worlds, that can be created, explored and destroyed.\u003c/p\u003e\r\n\r\n\u003cp\u003eShe has worked on several video games as a team member, a 3D generalist, yet only one of them has officially been published. She learned to code, and eventually started using Unity as her tool for making games. Her first solo project was a mini game for a game jam called Candy Jam.\u003c/p\u003e\r\n\r\n\u003cp\u003eAt the moment, she makes video games in her free time, \u0026quot;for love, not for money\u0026quot;, and for fun.\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/42.jpg","Company":"Cheil - Samsung"},{"Id":30,"FirstName":"Srđan","LastName":"Stošić","Bio":"\u003cp\u003eMCT iz pro\u0026scaron;log veka i njegova prva i najveća ljubav je Exchange server 5.5. Jedini je predavač koji je držao predavanja na svim dosada\u0026scaron;njim Sinergijama. Trenutno je fokusiran na hibridna re\u0026scaron;enja u E-Smart Public, Azure ili Office 365 cloud-u, takođe pruža SharePoint re\u0026scaron;enja spremna za Cloud, koja se bave poslovnim procesima poput ISO upravljanja dokumentima.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/30.jpg","Company":"E-Smart Systems"},{"Id":1047,"FirstName":"Boban","LastName":"Miksin","Bio":"\u003cp\u003eBoban is a craftsman with more than nine years of dedicated service to the development and management of new software.\u003c/p\u003e\r\n\r\n\u003cp\u003eHe uses the simple methods of an agile developer in regards to his architecture. He understands that a builder must live inside the project, anticipating, creating, and mastering the path of its evolution, making sure it works, and that it\u0026#39;s right, every step of the way.\u003c/p\u003e\r\n\r\n\u003cp\u003eHe understands that a finished project is only as strong as its aptitude to sustain its own indefinite adaptability.\u003c/p\u003e\r\n\r\n\u003cp\u003eMotto: \u003cem\u003e\u0026quot;What got you here won\u0026#39;t get you there\u0026quot;\u003c/em\u003e\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1047.jpg","Company":"Vega IT Sourcing"},{"Id":1056,"FirstName":"Goran","LastName":"Milanov","Bio":"\u003cp\u003eMicrosoft MVP za MS SQL Server. Sa Microsoft SQL Serverom produkciono je angažovan jo\u0026scaron; od verzije 6.5. Zone rada i interesovanja su mu DataWarehouse i BI sistemi i Microsoft SQL Server servisi: SSAS, SSRS, SSIS, MDS, DQS. Čest je gost na Microsoft konferencijama u na\u0026scaron;oj zemlji i u zemljama iz na\u0026scaron;eg okruženja. Pi\u0026scaron;e blog na \u003ca href=\"http://www.goranmilanov.rs/\"\u003ehttp://www.goranmilanov.rs\u003c/a\u003e.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1056.jpg","Company":"GoPro d.o.o. Beograd"},{"Id":61,"FirstName":"Martin","LastName":"Stanojević","Bio":"\u003cp\u003eMartin je ASP.NET Web Developer uglavnom fokusiran na UI deo web aplikacija. U proteklih 6 meseci, radio je na implementiranju novog dizajna \u003ca href=\"http://www.drey.com/\"\u003eDrey Business Portal-a\u003c/a\u003e\u0026nbsp;i na reimplementaciji Drey online servisa gde mu je fokus uglavnom bio na optmizaciji HTML, CSS i JavaScript koda.\u003cbr /\u003e\r\n\u003cbr /\u003e\r\nMartin obično ne priča o sebi u trećem licu, a ovo je izuzetak koji potvrđuje pravilo. Retko tvituje.\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/61.jpg","Company":"Drey Corporation"},{"Id":60,"FirstName":"Martin","LastName":"Kulov","Bio":"\u003cp\u003eMartin Kulov enjoys optimizing software development and operations. He loves picking up on various performance and quality issues that brings tremendous value to business.\u003c/p\u003e\r\n\r\n\u003cp\u003eFor his dedication to community and passion to help he is annually awarded with Microsoft Most Valuable Professional award in Visual Studio ALM since 2006. Starting from 2010 Martin is also member of the Microsoft Regional Director program to provide technical guidance and expertise to communities and businesses worldwide.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/60.jpg","Company":"kulov.net"},{"Id":25,"FirstName":"Damir","LastName":"Dizdarevic","Bio":"\u003cp\u003eDamir Dizdarević je diplomirani matematičar-informatičar, i radi kao menadžer MS CPLS edukacionog centra u kompaniji Logosoft d.o.o.,te kao predavač i autor MOC kurseva. Pored toga, radi i kao sistem dizajner za kompleksnija enterprise okruženja. Osnivač je i voditelj bosansko-hercegovačkog Microsoft Community-a. Sa Microsoft server platformama radi već zadnjih 18 godina, a posebno se specijalizirao se za Windows Server, Exchange Server, Security, mobilna i virtualizacijska re\u0026scaron;enja.\u003c/p\u003e\r\n\r\n\u003cp\u003eZa doprinose u preno\u0026scaron;enju znanja o Microsoft server proizvodima, rad u community-u te veliki broj održanih predavanja, Microsoft mu je prije 7 godina dodijelio status Most Valuable Professional \u0026ndash; MVP, a nosilac je i velikog broja tehničkih certifikata (MCSE,MCTS,MCITP,MCT) za Windows Server 2012, Exchange Server 2013 te Hyper-V. Redovno predaje i biva odlično ocijenjen na konferencijama u regionu kao \u0026scaron;to su MS Network, Microsoft Vizija, NT Konferenca, Windays itd. Na konferenciji Microsoft Sinergija u sedam prethodnih godina za redom bio je jedan od tri najbolja predavača po ocjenama publike. Jedan je od rijetkih predavača iz Evrope koji radi kao autor i recenzent oficijelnih MOC kurseva.\u003c/p\u003e\r\n\r\n\u003cp\u003eU prethodnoj i ovoj godini intenzivno je već par mjeseci angažovan na izradi serije oficijelnih kurseva za Windows Server 2012 i Exchange Server 2013. Pored toga, već 14 godina radi kao jedan od urednika BH Informatičkog magazina INFO, u kojem je do sada objavio preko 400 stručnih tekstova, a jedan je od rijetkih autora iz \u0026scaron;ireg regiona koji objavljuje i stručne tekstove u prestižnom Windows ITPro Magazinu (neki od tekstova su dostupni na : \u003ca href=\"http://windowsitpro.com/author/damir-dizdarevic\"\u003ehttp://windowsitpro.com/author/damir-dizdarevic\u003c/a\u003e).\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/25.jpg","Company":"Logosoft d.o.o. Sarajevo"},{"Id":1055,"FirstName":"Radovan","LastName":"Ostojić","Bio":"\u003cp\u003eProgramer i software arhitekt, sa specijalizacijom SharePoint i .Net.\u003c/p\u003e\r\n\r\n\u003cp\u003eŽivi i radi u Beogradu.\u003c/p\u003e\r\n\r\n\u003cp\u003eOženjen, otac jednog deteta.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1055.jpg","Company":"ComTrade"},{"Id":1050,"FirstName":"Nikola","LastName":"Živanović","Bio":"\u003cp\u003eNikola, also known as Randoman, is a Belgrade based product designer. When not writing about himself in the third person he does UI \u0026amp; UX design, builds apps and brews his own beer.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1050.jpg","Company":"Drey d.o.o"},{"Id":1048,"FirstName":"Ivan","LastName":"Lazarević","Bio":"\u003cp\u003eIvan Lazarević radi na poziciji Solution Architect u kompaniji S\u0026amp;T Serbia, gde na brojnim projektima učestvuje kao programer, arhitekta, team leader. Od 2009. godine je sertifikovani Scrum Master. Poseduje MCP, MCTS, MCSD serfifikate. Kroz svoj rad nastoji da primeni agilne metodologije u projektima na kojima učestvuje i promovi\u0026scaron;e takav način razmi\u0026scaron;ljanja. Poseban deo interesovanja su mu izučavanje arhitektura složenih softverskih re\u0026scaron;enja, agilne metodologije, TDD, savremeni softverski alati, različiti programski jezici. Trenutno je angažovan na razvoju aplikacija kori\u0026scaron;ćenjem Microsoft-ovih tehnologija (.NET Framework, ASP.NET MVC-a, EF...), integraciji različitih sistema i Mobility re\u0026scaron;enjima. Od 2005. godine radi na Fakultetu organizacionih nauka u Beogradu kao saradnik u nastavi na predmetu Projektovanje softvera na katedri za Softversko inženjerstvo, programski jezik C#.\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1048.jpg","Company":"S\u0026T Serbia"},{"Id":8,"FirstName":"Stanko","LastName":"Nikolić","Bio":"\u003cp\u003eStanko Nikolić dipl. inženjer elektrotehnike, Microsoft MCP. Zaposlen je u Računskom centru, Elektrotehničkog fakulteta Univerziteta u Beogradu. Profesionalno se bavi implementacijom savremenih softverskih re\u0026scaron;enja i istraživanjem novih tehnologija. Najvi\u0026scaron;e se bavi Microsoft tehnologijama i redovan je predavač na Microsoft konferencijama i skupovima. Radi kao projektant na nekoliko najvećih Windows Phone projekata u Srbiji.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/8.jpg","Company":"Elektrotehnički fakultet Beograd"},{"Id":26,"FirstName":"Bojan","LastName":"Nenadić","Bio":"\u003cp\u003eSolution Architect sa vi\u0026scaron;e od deset godina iskustva u izvođenju\u0026nbsp; kompleksnih re\u0026scaron;enja u oblasti infrastrukture. \u0026Scaron;irok dijapazon rada u informacionim tehnologijama stečen tokom 18 godina ukupnog iskustva, sa dubokim znanjem MS proizvoda - posebno Active Directory i Exchange. Dokazan uspeh u celokupnom arhitektonskom i projektnom ciklusu - od prvobitnih konceptnih re\u0026scaron;enja, kroz komunikacije i odbranu dizajna, do postavljnja sistema.\u003c/p\u003e\r\n\r\n\u003cp\u003eDobio najvi\u0026scaron;u Microsoft kvalifikaciju - Microsoft Certified Architect (MCA) - Exchange 2010; održao preko 100 kurseva tokom 15 godina kao MCT. Tokom godina sakupio značajno iskustvo i u oblasti mreža, obezbeđenja i vođenja projekata.\u003c/p\u003e\r\n\r\n\u003cp\u003eTrenutno vodi multi-milionski program transformisanja sistema i servisa za kontrolu identiteta i elektronsku po\u0026scaron;tu.\u003c/p\u003e\r\n\r\n\u003cp\u003eNeki od klijenata uključuju SABMiller, Deutsche Bank, Atos Origin, Olympic Delivery Authority (London 2012), Fujitsu, Computer Sciences Corporation CSC and Steria.\u003c/p\u003e\r\n\r\n\u003chr /\u003e\r\n\u003cp\u003eSolution Architect with ten years of extensive experience in delivering complex fit-for-purpose infrastructure transformation solutions. Developed broad IT skills over a period of 18 years with deep knowledge of Microsoft infrastructure technologies and a focus on Exchange and Active Directory. Proven ability to formulate a concept and communicate it to all layers of stakeholders, followed by a complete architectural and project life-cycle management.\u003c/p\u003e\r\n\r\n\u003cp\u003eAchieved highest Microsoft certification \u0026ndash; Microsoft Certified Architect on Exchange 2010; delivered over a hundred official MS courses in over 15 years as MCT. Also collected extensive experience with networking, security and general project management.\u003c/p\u003e\r\n\r\n\u003cp\u003eCurrently leading a multi-million pound programme to transform directory and messaging services for a multi-national corporation.\u003c/p\u003e\r\n\r\n\u003cp\u003eClients include: SABMiller, Deutsche Bank, Atos Origin, Olympic Delivery Authority, Fujitsu, Computer Sciences Corporation CSC and Steria.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/26.jpg","Company":null},{"Id":1060,"FirstName":"Milena","LastName":"Pajić","Bio":"\u003cp\u003eMilena Pajić ima vi\u0026scaron;e od 8 godina iskustva u IT industriji. Karijeru je započela kao software developer i tu vrstu posla je uspe\u0026scaron;no obavljala 4 i po godine. Master je Informatike kao i Professional Scrum Master u Scrum.org. Trenutno radi kao Project Manager u Execom-u gde u svakodnevnom radu praktikuje Scrum i Kanban na nekoliko projekata za koje je direktno odgovorna. Njeni timovi se sastoje od vi\u0026scaron;e od 15 ljudi I distriburani su u nekoliko zemalja.\u003c/p\u003e\r\n\r\n\u003cp\u003eMilena je od nedavno i Pluralsight autor.\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1060.jpg","Company":"Execom"},{"Id":1061,"FirstName":"Dragoslav","LastName":"Ogar","Bio":"\u003cp\u003eDragoslav Ogar je direktor/konsultant/predavač preduzeća A4ATCP d.o.o. Beograd, koje je zvanični Microsoftov partner. Ima vi\u0026scaron;e od 25 godina praktičnog i teoretskog iskustva u informacionim tehnologijama. Po zvanju je profesor matematike. Poseduje desetak zvaničnih MS titula od kojih je verovatno najznačajnija MVP for SQL Server.\u003c/p\u003e\r\n\u003cp\u003eKao Microsoftov trener, održao je vi\u0026scaron;e od 70 MOC-ova i preko 15.000 časova. Danas, najče\u0026scaron;će pravi sopstveni materijal (vežbe i primere) za konsultacije i radionice.\u003c/p\u003e\r\n\u003cp\u003eDragoslav je najče\u0026scaron;će nagrađivani predavač na Microsoftovim konferencijama u Srbiji. Na četiri međunarodne Microsoftove konferencije (Sinergija 04, 06, 10, 11 i 13), nagrađen je kao jedan od tri najbolja predavača.\u003c/p\u003e\r\n\u003cp\u003eOsim tema iz SQL Server oblasti, omiljene teme su mu i Entity Framework, OData, MVC i SOLID.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1061.jpg","Company":"A4ATCP"},{"Id":1052,"FirstName":"Srđan","LastName":"Stević","Bio":"\u003cp\u003eSrđan Stević je MCP je od 2003. Dugi niz godina se bavi sistemskom administracijom, projektovanjem, implementacijom i podr\u0026scaron;kom za Microsoft tehnologije (Windows Server, Active Directory, Exchange Server, Hyper-V, DirectAccess, RDS, Failover clustering). Zaposlen je kao sistem administrator na Učiteljskom fakultetu u Beogradu. Jedan je od lead-ova ITPro Serbia korisničke grupe i sa kolegama koordinira rad Microsoft community-ja u Srbiji. Kao jedan od najzahtevnijih, ali i najdražih projekata izdvaja migraciju Windows 2000 domena i Exchange 2000 infrastrukture na Windows 2003 i Exchange 2003 u prvoj fazi projekta, da bi u drugom delu nastavio migraciju kompletnog okruženja na Windows Server 2008 R2 i Exchange 2010. Vrlo ponosan na činjenicu da je učestvovao u jednoj od prvih Hyper-V Live migration implementacija u Srbiji. Svakodnevno ga možete pratiti na https://twitter.com/srdjanstevic , a detaljan profil se nalazi na http://www.linkedin.com/pub/srdjan-stevic/b/a2/6a7\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1052.jpg","Company":"Učiteljski fakultet"},{"Id":22,"FirstName":"Borislav","LastName":"Blagojević","Bio":"\u003cp\u003eBorislav is experienced UX/Interaction designer, information architect, web and mobile developer, consultant, speaker and writer. Background in visual design and marketing helps him understand all aspects of connected digital world, while programming expertise allows his ideas to come to life. Since 1995, he works for several international companies on various projects for clients in the USA, UK, Ireland, Germany and Taiwan. He is Microsoft Certified Professional and proud member of Interaction Design Association and Information Architecture Institute.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/22.jpg","Company":"Atamagai"},{"Id":31,"FirstName":"Catalin","LastName":"Gheorghiu","Bio":"\u003cp\u003eCatalin Gheorghiu je solution architect iz Rumunije. Strast prema tehnologiji je započela pre nekoliko decenija, od računara koji su koristili bu\u0026scaron;ene kartice, i prerasla je u profesiju. Ima vi\u0026scaron;e od 15 godina iskustva u razvoju rje\u0026scaron;enja, posebno na Microsoft tehnologijama i u vrlo zahtjevnim okruženjima - pri čemu se trudio da tu tehnologiju koristi na inovativan način.Trenutno je zainteresiran za razvoj za mobilne platforme i za cloud platforme. Pored bavljenja razvojem i arhitekturom, je i trener i konzultant . U slobodno vremenu član je tehničkih zajednica, doprinosi svojim tekstovima i blogovima na nekoliko korisničkih grupa (MrSmersh), drži predavanja svuda po Rumuniji i lider je RONUA korisničke grupe u Temi\u0026scaron;varu. Od 2011, svake godine mu je dodijeljena Microsoft MVP nagrada, a od 2012 Nokia mu je dodelila nagradu Nokia Developer Champion.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/31.jpg","Company":"I Computer Solutions"},{"Id":48,"FirstName":"Milorad","LastName":"Imbra","Bio":"\u003cp\u003eMilorad Imbra - Technology Line Manager za Microsoft tehnologije u kompaniji Seavus; MCSD Web Applications, MCTS Dynamics CRM 2011 Applications. Solution Designer i Developer na mnogim internacionalnim projektima iz domena telekomunikacija.\u003c/p\u003e\r\n\r\n\u003cp\u003ePredavač na internim radionicama, okupljanjima .NET zajednice i lokalnim konferencijama. Organizator Global Windows Azure Boot Campa u Ni\u0026scaron;u.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/48.jpg","Company":"Seavus"},{"Id":36,"FirstName":"Dejan","LastName":"Pervulov","Bio":"\u003cp\u003eKao tehnički konsultant učestvovao je na brojnim ERP, CRM i DWH/BI projektima u regionu. Razvojem na Microsoft tehnologijama bavi se već 15 godina i poseduje MCT, MCSD, MCDBA, MCTS, MCSA i MCITP sertifikate. Kao Microsoft Certified Trainer bio je angažovan na pripremi i održavanju obuka u vi\u0026scaron;e \u0026scaron;kolskih centara u Srbiji.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/36.jpg","Company":"Agencija za privredne registre"},{"Id":1062,"FirstName":"Miroslav","LastName":"Aničin","Bio":"\u003cp\u003eA highly dynamic, energetic and motivated Executive and Practitioner with 20+ years of diverse experience in Project Management, Business Process Management, Solution Architecture and ERP implementation. Results-oriented visionary who has demonstrated ability to successfully design strategies and create innovative and cost-effective approaches to project management and execution of overall corporate business process improvement. A proactive, resourceful servant and grateful leader to diverse teams of professionals with extensive managerial, motivational and leadership skills.\u003c/p\u003e\r\n\r\n\u003cul\u003e\r\n\t\u003cli\u003eCertified Project Management Professional \u0026ndash; PMP\u003c/li\u003e\r\n\t\u003cli\u003eCertified Business Analysis Professional - CBAP\u003c/li\u003e\r\n\t\u003cli\u003eCertified Scrum Master - CSM\u003c/li\u003e\r\n\t\u003cli\u003eCertified Scrum Product Owner - CSPO\u003c/li\u003e\r\n\t\u003cli\u003eCertified Six Sigma White Belt\u003c/li\u003e\r\n\t\u003cli\u003eExperienced in ASAP Project Methodology,\u0026nbsp;Enterprise Architecture frameworks,\u0026nbsp;Business Process Management\u003c/li\u003e\r\n\u003c/ul\u003e\r\n","PictureUrl":"Content/Images/Speakers/1062.jpg","Company":"ComTrade ITSS"},{"Id":40,"FirstName":"Srđan","LastName":"Maksimović","Bio":"\u003cp\u003eSrđan Maksimović je Senior System Engineer u EUnetu i Windows Team Leader. Diplomirao je na Fakultetu za informacione tehnologije u Beogradu. Takođe, Srđan je i Microsoft Certified System Engineer (MCSE) 2012 Server Infrastructure.\u003c/p\u003e\r\n\r\n\u003cp\u003eVi\u0026scaron;e od 12 godina bavi se sistemskom administracijom i podr\u0026scaron;kom za Microsoft tehnologije (Windows Server, Exchange\u0026nbsp; Server, Hyper-V, Active Directory, SQL server). Dizajnirao je Microsoft Hyper-V\u0026nbsp;\u0026nbsp;Cloud za EUnet d.o.o. (\u003ca href=\"http://www.eunethosting.com/en/hyperv-cloud-servers\"\u003ehttp://www.eunethosting.com/en/hyperv-cloud-servers\u003c/a\u003e), kao i Microsoft Exchange Shared Hosting (\u003ca href=\"http://www.eunethosting.com/exchange-hosting\"\u003ehttp://www.eunethosting.com/exchange-hosting\u003c/a\u003e).\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/40.jpg","Company":"EUnet"},{"Id":59,"FirstName":"Vekoslav","LastName":"Stefanovski","Bio":"\u003cp\u003eWekoslav Stefanovski has over a decade of professional developer experience using a variety of development technologies. He has been using .net and C# to build enterpise-level applications since the first public beta, and JavaScript since the turn of the century. Areas of special interest include functional programming, static code analysis, code quality metrics, performance optimization and refactoring.\u003c/p\u003e\r\n\r\n\u003cp\u003eCurrently works in Seavus as a Senior Developer.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/59.jpg","Company":"Seavus"},{"Id":11,"FirstName":"Srđan","LastName":"Božović","Bio":"\u003cp\u003eSrđan Božović Microsoft MVP, MCT. Radi kao arhitekta softverskih re\u0026scaron;enja u kompaniji MFC Mikrokomerc. Profesionalno se bavi programiranjem poslednjih petnaest godina. Trenutno je fokusiran na re\u0026scaron;enja koja povezuju Windows Azure platformu i mobilne uređaje bazirane na Microsoft platformi, Windows Phone i Windows 8. Voli da eksperimenti\u0026scaron;e sa različitim programskim jezicima. U aprilu 2009-te godine, postao je MVP za C#.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/11.jpg","Company":"MFC Mikrokomerc"},{"Id":1058,"FirstName":"Marija","LastName":"Vujošević","Bio":"\u003cp\u003eMarija Vujo\u0026scaron;ević je diplomirani informatičar. Zaposlena je u kompaniji ITLab. Poseduje vi\u0026scaron;egodi\u0026scaron;nje iskustvo u razvoju .NET aplikacija (ERP, Document management, CRM). Interesuje se i za oblast za\u0026scaron;tite informacija.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1058.jpg","Company":"ITLab d.o.o"},{"Id":57,"FirstName":"Damir","LastName":"Barjaktarević","Bio":"\u003cp\u003eDamir Barjaktarević je managing director firme GoPro d.o.o. Razvojem poslovnog software-a se bavi već vi\u0026scaron;e od 15 godina. Microsoft Dynamics NAV-om (tada Navision-om) je počeo da se bavi od samog pojavljivanja ovog ERP sistema u Srbiji, pre 10 godina. Vodio je veliki broj implementacija, od malih do najvećih Dynamics NAV projekata u zemlji. Dve godine je radio i u inostranstvu, vodeći međunarodne projekte implementacije Dynamics NAV sistema, prilikom čega je stekao veliko iskustvo i radio sa najvećim Dynamics NAV partnerima u Evropi. Dobre poslovne prakse koje je u tom periodu stekao je preneo u GoPro. Poseduje dva Microsoft sertifikata, Development i Installation and Configuration za Microsoft Dynamics NAV.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/57.jpg","Company":"GoPro"},{"Id":45,"FirstName":"Milica","LastName":"Tomić Jovanović","Bio":"\u003cp\u003eVolim da govorim o sebi kao o experience dizajneru koji uvek uzima u obzir ljude za koje radi, sa svim njihovim specifičnostima.\u003c/p\u003e\r\n\r\n\u003cp\u003eZajedno sa Jankom, vodim malu dizajn agenciju. Mi pomažemo klijentima, malim i velikim, pri oblikovanju proizvoda i usluga. Takođe se bavimo edukacijom development i dizajn timova i pomažemo im da integri\u0026scaron;u dizajn proces u svoje postojeće procese proizvodnje.\u003c/p\u003e\r\n\r\n\u003cp\u003eUče\u0026scaron;će na konferencijama mi donosi veliko zadovoljstvo jer mi omogućava da podelim i pro\u0026scaron;irim znanje. Do sada sam pričala na nekoliko konferencija: ffwd.pro 2013 - Zagreb, RenderConf - Novi Sad i DaFED #15 - Novi Sad. Učestvovala sam i na dev konferencijama, ali to je bilo u mom prethodnom životu developera.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/45.jpg","Company":"Studio at Warp Speed"},{"Id":41,"FirstName":"Vladimir","LastName":"Marković","Bio":"\u003cp\u003eVladimir Marković je zavr\u0026scaron;io matematički fakultet i vi\u0026scaron;e od 11 godina je u bankarskoj industriji . Poslednjih 9 godina bavi se DW/BI. Učestvovao je u razvoju i implementaciji različitih DW/BI re\u0026scaron;enja (aCI, CRMS, CS, MIS, PMRS) u različitim ulogama i na različitim platformama (Microsoft, Cognos, SAS). Koristi Kimball metodologiju u razvoju DW/BI, a oblasti interesovanja su mu dimenziono modelovanje i istraživanje podataka (data mining).\u003c/p\u003e\r\n\u003cp\u003eTrenutno je na poziciji arhitekte softvera poslovne inteligencije u Banci Intesa Beograd.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/41.jpg","Company":"Banka Intesa AD Beograd"},{"Id":12,"FirstName":"Ljubomir","LastName":"Ivaniš","Bio":"\u003cdiv class=\"speaker-bio-big\"\u003eRođen u Beogradu, računarima se bavi od devedesetih. Zaposlen je u firmi CPU d.o.o. gde radi kao predavač, vr\u0026scaron;i odabir i kreira nove kurseve. Radi na razvoju IT community-ja u Srbiji kroz IT Pro User Groupu. Specijalnosti su mu virtualizacija, bezbednost i \u0026scaron;to\u0026scaron;ta drugo. Redovan učesnik na svim većim IT skupovima.\u003c/div\u003e\r\n","PictureUrl":"Content/Images/Speakers/12.jpg","Company":"CPU d.o.o."},{"Id":1063,"FirstName":"Gilles","LastName":"Pommier","Bio":"\u003cp\u003eGilles Pommier is a senior SharePoint Consultant and Office 365 MVP. He\u0026#39;s the co-owner of SmartView, an IT Consulting company in France. During the last 7 years, he has helped numerous companies in their implementation for SharePoint architecture and developpment.\u003c/p\u003e\r\n\r\n\u003cp\u003eSince 2005, he has also participated in several events such as Microsoft TechEd U.S., TechEd Australia, TechEd EMEA TechEd Dubai TechDays France as a speaker on Office 365, SharePoint, .Net and VSTO technologies.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1063.jpg","Company":"SmartView"},{"Id":16,"FirstName":"Nemanja","LastName":"Stančić","Bio":"\u003cp\u003eI am passionate developer, creator and leader.\u0026nbsp; When I\u0026lsquo;m making new product i try to be involved in every aspect of it\u0026lsquo;s production, not only in coding.As a Windows Phone developer in company Drey I have achieved shipping beautiful and fast instant messenger Piip Messenger for Windows Phone store. I love working with large number of users, and competing with companies on global basis.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/16.jpg","Company":"Drey Corporation"},{"Id":1069,"FirstName":"Sinisa","LastName":"Perović","Bio":"\u003cp\u003eI am trying to convert grey mass in me and outhere to something more meaningfull and give it a sense of existence, wisdom and future...through aplying diferent colors, pressure or tools...so, at the end you can see me as a painter, sculptor, carpenter or just an evangelist.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1069.jpg","Company":"Microsoft"},{"Id":1057,"FirstName":"Svetlana","LastName":"Stošić Milosavljević","Bio":"\u003cp\u003eZaposlena u kompaniji TeleSkin na poziciji Senior Creative Designer. Dizajnom se bavi vi\u0026scaron;e od 7 godina, sa akcentom na kreiranje i razvoj web aplikacija. Poslednje dve godine radi dizajn za desktop i mobilne aplikacije.\u003c/p\u003e\r\n\r\n\u003cp\u003eDizajner je skinScan aplikacije za detekciju melanoma kože koja je dobila nagradu od Microsoft Health Users Group-e za Innovation Awards 2013 godine.\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1057.jpg","Company":"TeleSkin"},{"Id":13,"FirstName":"Aleksandar","LastName":"Totović","Bio":"\u003cp\u003eAleksandar Totović je MVP (Microsoft Most Valuable Professional) za Microsoft Dynamics NAV. Trenutno je zaposlen kao ERP Consulting Director u kompaniji NPS Beograd. Aleksandar je dugogodi\u0026scaron;nji ERP Consultant i Project Manager. Upravljao je na puno međunarodnih projekata, kao i na mnogim složenim projektima prizvodnje i građevinske delatnosti. Trenutno vodi tim iskusnih ERP Consultanata and Project Manager-a i radi na popularizaciji NAV-a i vertikalnih re\u0026scaron;enja.\u003c/p\u003e\r\n\r\n\u003cp\u003eVi\u0026scaron;e od 10 godina je u NAV-u, a vi\u0026scaron;e od 30 godina u IT-u (od detinjstva). Predavač na mnogim konferencijama, MVP, MCC, i jedan od najznačajnijih članova globalnog Dynamics NAV Community, autor puno wiki članaka, bloger, učesnik na forumima (Dynamics Community, NAVUG, TechNet, Mibuso,...)\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/13.jpg","Company":"NPS d.o.o."},{"Id":46,"FirstName":"Aleksandar","LastName":"Nikolić","Bio":"\u003cp\u003eAleksandar Nikolić je Microsoft Most Valuable Professional za Windows PowerShell, osnivač \u003ca href=\"http://PowerShellMagazine.com\"\u003ePowerShellMagazine.com\u003c/a\u003e i administrator portala \u003ca href=\"http://PowerShell.com\"\u003ePowerShell.com\u003c/a\u003e. Uz 17-godi\u0026scaron;nje iskustvo na poslovima sistem administracije i automatizacije, tokom poslednjih 5 godina fokusiran je na Windows PowerShell obuke i prezentovanje na Microsoftovim i drugim IT konferencijama u regionu, Evropi i Americi.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/46.jpg","Company":"PowerShell Magazine"},{"Id":27,"FirstName":"Zoran","LastName":"Horvat","Bio":"\u003cp\u003eZoran Horvat ima vi\u0026scaron;e od 15 godina iskustva u razvoju i arhitekturi softvera. Poslednjih godina posvećen je istraživanju različitih pristupa u dizajniranju softvera koji su usmereni ka olak\u0026scaron;avanju održavanja i nadograđivanja aplikacija nakon odlaska u produkciju. Pokazalo se da je to veoma zahtevno i \u0026scaron;iroko polje istraživanja, ali i oblast koja bogato nagrađuje uloženi trud. Uspeh u razvoju korporativnog softvera postao je dostižan jedino uz primenu posebnih re\u0026scaron;enja u dizajnu, testiranju, integraciji, dokumentovanju. Takvo stanje obećava da ćete Zorana i ubuduće sretati u blizini velikih aplikacija.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/27.jpg","Company":"InterVenture Nearshoring GmbH"},{"Id":44,"FirstName":"Omar","LastName":"Kudović","Bio":"\u003cp\u003eZaposlen u ProCredit Bank d.d. Sarajevo na poziciji System Administrator. IT iskustvo preko deset godina i veći dio toga vremena isključivo vezan za Exchange Server i \u0026bdquo;messaging solutions\u0026ldquo;. Posljednjih par godina intenzivno radi i uči o integracijama OCS / Lync Server 2010/2013 i Exchange Server i primjeni rje\u0026scaron;enja u poslovnom okruženju (audio / video / voice / messaging / security). Neka iskustva oko Lync Server 2010/2013 već prezentovao na MS Community BiH. Aktivan član Microsoft Community BiH, na kojem držim predavanja na temu integracija i rje\u0026scaron;enja u primjeni Lync Server 2010 i 2013 . Predavao na MS Network konferenciji 2012 / 2013, MS Community Conference 2012/2013, MS TechDay 2012/2013. U BiH IT magazinu Info objavljuje tekstove na temu Lync Server. Tokom 2013. godine od strane Microsoft nagrađen MVP titulom za Lync Server 2013.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/44.jpg","Company":"ProCredit Bank d.d. Sarajevo, BIH"},{"Id":39,"FirstName":"Milica","LastName":"Medić","Bio":"\u003cp\u003eMaster engineer of\u0026nbsp; Electrical Engineering nad Computer Science. Working in ApexSQL, blogs at \u003ca href=\"http://www.sqlshack.com/\"\u003eSQL Shack\u0026nbsp; \u003c/a\u003eand \u003ca href=\"http://solutioncenter.apexsql.com/\"\u003eApexSQL SolutionCenter\u003c/a\u003e. Areas of expertise and interest database refactoring and query performance tuning\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/39.jpg","Company":"ApexSQL"},{"Id":32,"FirstName":"Janko","LastName":"Radusinović","Bio":"\u003cp\u003eTrenutno je Solution Architect u Andantino d.o.o. Bavi se programiranjem preko 20 godina, najpre za slavu (\u0026scaron;to je uključivalo pobede na desetak takmičenja, od gradskih do međunarodnih), a od 1993. profesionalno. Crnogorski geni uvek insistiraju da se sve \u0026scaron;to se mora uraditi uradi na najlak\u0026scaron;i način, \u0026scaron;to zahteva konstantno praćenje novih tehnologija i otkrivanje prečica koje nam one omogućavaju. Poučen poslovicom \u0026quot;Ako od alata imate samo čekić, svi problem će vam izgledati kao ekseri\u0026quot;, izbegava specijalizaciju u jednoj oblasti \u0026scaron;to mu, veruje, pomaže da re\u0026scaron;enja nalazi tačno na onom mestu gde ih je najlak\u0026scaron;e implementirati. Trenutno je MCPD za Azure, Web, Windows, WindowsPhone I Silverlight,kao I i MCITP Database Dev SQL 2008.\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/32.jpg","Company":"Andantino"},{"Id":1071,"FirstName":"Aleksandar","LastName":"Djordjevic","Bio":"\u003cp\u003eCreating strategies, business alignment, supporting initiatives and added value valorization, for our customers and partners, by supporting better technology understanding and adaptation. Evangelizing about new trends, possibilities, journey and opportunities to grow.\u003cbr /\u003e\r\n\u003cbr /\u003e\r\nDriving Cloud and Infrastructure Optimization workshops, performing gap analysis and enabling better IT2Business alignment. Helping our clients to accelerate technology adaptation and integration, in service of core business, by creating strategy and strategic initiatives.\u003cbr /\u003e\r\n\u003cbr /\u003e\r\nExploring possibilities and engaging with IT Pro community to create more agile and business centric ICT ecosystem. Active participant and contributor to local ICT community\u003c/p\u003e\r\n","PictureUrl":"Content/Images/Speakers/1071.jpg","Company":"Microsoft"}],"Sessions":[{"Id":52,"Track":"CLD","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":200,"RoomId":1,"Title":"Mehanizam iza kulisa – razvoj backend-a za mobilne igre","Description":"\u003cp\u003eTema ove sesije je pametan odabir serverskih\u003cstrong\u003e\u0026nbsp;\u003c/strong\u003etehnologija za podr\u0026scaron;ku servera za svrhe jedne mobilne igre. Prvenstveno će se pričati o odabiru baze dobre za brzo prototipiziranje i promenu detalja, \u0026scaron;to su česte pojave u razvoju igara. \u003cstrong\u003eMongoDB\u003c/strong\u003e, kao ozbiljan predstavnik noSQL baza podataka igraće veliku ulogu u sesiji, gde će se demonstrirati za\u0026scaron;to je isplativo koristiti ga, i na koji način. Biće reči i o\u0026nbsp;\u003cstrong\u003eredis\u003c/strong\u003e-u, koji je veoma napredan rečnik (key-value store), dobar za česta pisanja i čitanja -- dva do tri puta brži od MongoDBa. Takođe, biće pomenute kombinacije kori\u0026scaron;ćenja SQL i noSQL baza kada je takva taktika isplativa.\u003c/p\u003e\r\n\r\n\u003cp\u003eDrugi deo sesije baviće se temom arhitekture odnosa server-klijent u slučaju igara: o načinima povezivanja, vrlinama i manama svakog od njih, kao i hibridnim re\u0026scaron;enjima, predikciji sa klijentske strane i drugim stvarima bitnim za uspe\u0026scaron;no umrežavanje igrača.\u003c/p\u003e\r\n"},{"Id":25,"Track":"DBI","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":300,"RoomId":2,"Title":"SQL Server Log Shipping customization","Description":"\u003cp\u003eU praksi se često javlja potreba za \u0026quot;read only\u0026quot; kopijama podataka.Pored toga \u0026scaron;to nam može služiti kao backup ili Disaster Recovery, može se koristiti i za rasterećejne produkcione baze.\u003c/p\u003e\r\n\r\n\u003cp\u003eDobrodo\u0026scaron;li ste da zajedno prodjemo kroz način rada log shippinga, pogledamo tehnike koje on koristi i prodiskutujemo o načinu za razvoj custom re\u0026scaron;enja log shippinga i njegovog monitoringa.\u003c/p\u003e\r\n"},{"Id":38,"Track":"DYN","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":200,"RoomId":3,"Title":"Web Service @ Microsoft Dynamics NAV 2013 R2","Description":"\u003cul\u003e\r\n\t\u003cli\u003eIstorija interfejsa između raznorodnih Sistema, sa primerima iz prakse\u003c/li\u003e\r\n\t\u003cli\u003eOverview of Microsoft Dynamics NAV Web Services\u003c/li\u003e\r\n\t\u003cli\u003eSOAP and Odata web services\u003c/li\u003e\r\n\t\u003cli\u003eNekoliko primera kreiranje i upotrebe web servisa u praksi\u003c/li\u003e\r\n\t\u003cli\u003e...\u003c/li\u003e\r\n\u003c/ul\u003e\r\n"},{"Id":1043,"Track":"DVC","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":200,"RoomId":4,"Title":"Lako moze svako - Windows Phone i Windows 8.1 aplikacije","Description":"\u003cp\u003e(Scena nalik na reklamu jedne od banaka u Srbiji)\u003cbr /\u003e\r\nDobar dan... Ja bih jednu aplikaciju za Windows Phone\u003cbr /\u003e\r\n\u0026nbsp;- Može!\u003cbr /\u003e\r\nAli da radi i na računaru\u003cbr /\u003e\r\n\u0026nbsp;- Može!\u003cbr /\u003e\r\nAli znate ja se bas i ne razumem u sa programire ba\u0026scaron; najbolje...\u003cbr /\u003e\r\n\u0026nbsp;- Nije problem!\u003cbr /\u003e\r\nA ako ne\u0026scaron;to naučim mogu posle da dodajem neke cool opcije?\u003cbr /\u003e\r\n\u0026nbsp;- Naravno!\u003cbr /\u003e\r\n\u003cbr /\u003e\r\nSvi imaju ideje za aplikacije i želeli bi da ih naprave, ali jednostavno nemaju vremena da se posvete tome. Uz \u003cstrong\u003eWindows Phone App Studio\u003c/strong\u003e možete sačuvati vreme i za nekoliko minuta do sat vremena napraviti željenu aplikaciju, a da pri tome ne kodirate.\u003c/p\u003e\r\n\r\n\u003cp\u003eWindows Phone App Studio je alat koji omogućava lako kreiranje, objavljivanje, testiranje i deljenje aplikacija sa klijentima, saradnicima ili prijateljima. Ako ste početnik ovo je idealan početak, takođe ako ste developer lako se može izgenerisati source kod koji možete implementirati u Visual Studio i nastaviti sa radom i razvijati ne\u0026scaron;to zahtevnije. Windows Phone App Studio koristi svima u različite svrhe.\u003c/p\u003e\r\n"},{"Id":20,"Track":"UX ","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":100,"RoomId":5,"Title":"UX dizajn za development timove","Description":"\u003cp\u003eCilj predavanja je da development timovima približi User Experience dizajn proces i pokaže zbog čega je integracija UX procesa u development procese važna i kako se integracijom kreiraju bolji proizvodi, koji neuporedivo bolje prolaze na trži\u0026scaron;tu i koje korisnici bolje prihvataju.\u003c/p\u003e\r\n"},{"Id":1066,"Track":"SRV","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":300,"RoomId":6,"Title":"SC VMM 2012 R2 - one click deployment virtualnog IT okruženja ","Description":"\u003cp\u003ePored toga \u0026scaron;to VMM možemo da koristimo za klasičan menadžment virtualnih ma\u0026scaron;ina, videćemo primer kako kori\u0026scaron;ćenjem VMM-a i powershell-a možemo uraditi deployment komplikovane virtualne IT infrastrukture (npr. Exchange okruženja).\u003c/p\u003e\r\n"},{"Id":19,"Track":"APM","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":200,"RoomId":7,"Title":"Tipične greške kod planiranja i nadgledanja softverskih projekata","Description":"\u003cp\u003eKoliko puta ste napravili odlična plan i krenuli u izradu novog softvera. Kad odjednom - kaos. Korisnik je nezadovoljan, kasnite, softver je prepun bugova, radite prekovremeno, sve ste napetiji, a kraj se ne nazire. Ako nikad niste upali u ovakvu situaciju, vi ste - GENIJE! Ako ste bar jednom doživjeli ovaj scenarij dođite na predavanje da podijelimo bol zajedno. Bez ppt slajdova, samo iz glave izjadat ću Vam se od srca i reći \u0026scaron;to su tipične porge\u0026scaron;ke oje dovode do ovakvih situacija.\u003c/p\u003e\r\n\r\n\u003cp\u003eVIDIMO SE!\u003c/p\u003e\r\n"},{"Id":1068,"Track":"ALM","DayId":1,"TimeLine":1,"Lang":"Na našem","Level":200,"RoomId":8,"Title":"HOL - Provozajte Team Foundation Server i Visual Studio 2013 pod punim gasom","Description":"\u003cdiv class=\"info-box yellow\"\u003e\r\n\u003cdiv class=\"msg\"\u003e\r\n\u003cp\u003e\u003cstrong\u003e\u003ci class=\"icon-warning\"\u003e\u003c/i\u003eSve Hand-On Labove možete da radite ceo dan, bez obzira na termine\u003c/strong\u003e\u003c/p\u003e\r\n\u003c/div\u003e\r\n\u003c/div\u003e\r\n\r\n\u003cdiv class=\"space-sep\"\u003e\u0026nbsp;\u003c/div\u003e\r\n\r\n\u003cp\u003eAplication Lifecycle Managment hand-on labovi vam omogućavaju da probate razna scenarija upotrebe Team Foundation Server-a 2013 i Visual Studio-a 2013.\u003c/p\u003e\r\n\r\n\u003cp\u003ePridružite nam se\u0026nbsp;i probajte neki od sledećih HOL-ova\u003c/p\u003e\r\n\r\n\u003cul\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Agile%20Planning%20and%20Portfolio%20Management%20with%20Team%20Foundation%20Server%202013.docx\"\u003eAgile Planning and Portfolio Management with Team Foundation Server 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Getting%20Started%20with%20Git%20using%20Team%20Foundation%20Server%202013.docx\"\u003eGetting Started with Git using Team Foundation Server 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Embracing%20Continuous%20Delivery%20with%20Release%20Management%20for%20Visual%20Studio%202013.docx\"\u003eEmbracing Continuous Delivery with Release Management for Visual Studio 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/New%20Collaboration%20Experiences%20for%20Development%20Teams%20using%20Team%20Foundation%20Server%202013.docx\"\u003eNew Collaboration Experiences for Development Teams using Team Foundation Server 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Authoring%20and%20Running%20Manual%20Tests%20using%20Microsoft%20Test%20Manager%202013.docx\"\u003eAuthoring and Running Manual Tests using Microsoft Test Manager 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Branching%20and%20Merging%20Visualization%20with%20Visual%20Studio%20Team%20Foundation%20Server%202013.docx\"\u003eBranching and Merging Visualization with Visual Studio Team Foundation Server 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Building%20the%20Right%20Software%20-%20Generating%20Storyboards%20and%20Collecting%20Stakeholder%20Feedback%20with%20Visual%20Studio%202013.docx\"\u003eBuilding the Right Software - Generating Storyboards and Collecting Stakeholder Feedback with Visual Studio 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Code%20Discovery%20using%20the%20Architecture%20Tools%20in%20Visual%20Studio%20Ultimate%202013.docx\"\u003eCode Discovery using the Architecture Tools in Visual Studio Ultimate 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Debugging%20with%20IntelliTrace%20using%20Visual%20Studio%20Ultimate%202013.docx\"\u003eDebugging with IntelliTrace using Visual Studio Ultimate 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Diagnosing%20Issues%20in%20Production%20with%20IntelliTrace%20and%20Visual%20Studio%202013.docx\"\u003eDiagnosing Issues in Production with IntelliTrace and Visual Studio 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Exploratory%20Testing%20using%20Microsoft%20Test%20Manager%202013.docx\"\u003eExploratory Testing using Microsoft Test Manager 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Introduction%20to%20Coded%20UI%20Tests%20with%20Visual%20Studio%20Ultimate%202013.docx\"\u003eIntroduction to Coded UI Tests with Visual Studio Ultimate 2013\u003c/a\u003e\u003c/li\u003e\r\n\t\u003cli\u003e\u003ca href=\"http://download.microsoft.com/download/B/C/8/BC8558E1-192E-4286-B3B0-320A8B7CE49D/Introduction%20to%20Platform%20Testing%20with%20Microsoft%20Test%20Manager%202013.docx\"\u003eIntroduction to Platform Testing with Microsoft Test Manager 2013\u003c/a\u003e\u003c/li\u003e\r\n\u003c/ul\u003e\r\n"},{"Id":54,"Track":"GAM","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":100,"RoomId":1,"Title":"The Joy of Unity - an introduction to making games with Unity 3D Free for MS Windows","Description":"\u003cp\u003e\u003cstrong\u003eTHE JOY OF UNITY\u003c/strong\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eGeneral introduction to making games with Unity 3D Free for MS Windows\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003eThis lecture is not only for game developers, it\u0026rsquo;s for all game - friendly enthusiasts including architects who search for a more advanced presentation for their design, parents who want to entertain their kids, etc.\u003c/p\u003e\r\n\r\n\u003cp\u003eThe lecture will cover most of the awesome tools for making video games in the free version of Unity 3D.\u003c/p\u003e\r\n\r\n\u003cp\u003eThe first half of the presentation will be the theoretical introduction to Unity\u0026rsquo;s amazing features, and in the second part we will make a small adventure game and publish it for Windows.\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cstrong\u003ePart One: General introduction to Unity\u003c/strong\u003e\u003c/p\u003e\r\n\r\n\u003col\u003e\r\n\t\u003cli\u003eIntroduction to the Unity Editor: Project browser, Inspector, Scene view, Game view, Hierarchy\u003c/li\u003e\r\n\t\u003cli\u003eIntroduction to Workflow: importing assets (3D objects, textures, sounds, scripts)\u003c/li\u003e\r\n\t\u003cli\u003eBuilding a scene and scene :\u003c/li\u003e\r\n\u003c/ol\u003e\r\n\r\n\u003col\u003e\r\n\t\u003cli\u003eGraphics (Meshes, Mesh Renderers, Textures, Materials, Lights, Cameras)\u003c/li\u003e\r\n\t\u003cli\u003eTerrains\u003c/li\u003e\r\n\t\u003cli\u003eAudio (Audio Listeners and Audio Sources)\u003c/li\u003e\r\n\t\u003cli\u003ePhysics (Colliders, Colliders ad Triggers, Rigidbodies, Physics Materials)\u003c/li\u003e\r\n\t\u003cli\u003eAnimation \u0026amp; Mechanim (Animator component, Humanoid Avatars, Avatar Masks)\u003c/li\u003e\r\n\t\u003cli\u003eNavigation (Navigation Overview, NavMesh Baking, NavMesh Agent, Obstacles)\u003c/li\u003e\r\n\t\u003cli\u003eBasic Scripting (Scripts ad Behaviour Components, Editors, Conventions etc.)\u003c/li\u003e\r\n\t\u003cli\u003eTesting the game\u003c/li\u003e\r\n\t\u003cli\u003ePublishing the game\u003c/li\u003e\r\n\u003c/ol\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003e\u003cstrong\u003ePart Two:\u003c/strong\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003eMaking a small adventure game. This will be the interactive part where the audience will be asked to suggest some assets of the scene. Some of the features will be practically shown here, as well as some very basic coding. In the end the game will be published for Windows (and offered for download to all of the participants of the conference)\u003c/p\u003e\r\n"},{"Id":16,"Track":"SES","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":200,"RoomId":2,"Title":"Office 365 sve što ste hteli da pitate, a niste imali koga - treći put","Description":"\u003cdiv class=\"lecture\"\u003e\r\n\u003cdiv class=\"malinaslov\"\u003eOffice 365 = Poverenje?\u003c/div\u003e\r\n\r\n\u003cp\u003eIsplativost, migracija, dostupnost, bezbednost, sigurnost, iskustva iz prakse!?\u003c/p\u003e\r\n\u003c/div\u003e\r\n"},{"Id":1035,"Track":"DEV","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":400,"RoomId":3,"Title":"TDD u praksi","Description":"\u003cp\u003eTDD zvuči dobro i svi znamo \u0026scaron;ta znači, ali kako ga usvojiti i primeniti u svakodnevnom radu? Kada ga primeniti, a kada ne? Odakle početi i kako ovladati tehnikom? Koje alate koristiti? Predavanje ima za cilj da odgovori na sva ova pitanja i da predoči \u0026ldquo;test first\u0026rdquo; način razmi\u0026scaron;ljanja.\u003c/p\u003e\r\n\r\n\u003ciframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/TFSYJFe-SbU\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e"},{"Id":1045,"Track":"DBI","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":300,"RoomId":4,"Title":"Microsoft Power BI za Office 365","Description":"\u003cp\u003eMicrosoft je zadnjih godina, pored toga \u0026scaron;to je puno radio na raznim tehnologijama koje su podr\u0026scaron;ka razvoju Data Warehouse-a i sistema Poslovne Inteligencije, takođe radio i na tehnologijama koje služe za\u0026nbsp; prezentaciju podataka sistema Poslovne Inteligencije (BI). Za očekivati je bilo da će se pojaviti i tehnologije koje donose izuzetan prezentacioni nivo i lakoću kori\u0026scaron;ćenja na Office 365.\u003c/p\u003e\r\n"},{"Id":1039,"Track":"WEB","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":200,"RoomId":5,"Title":"The Need For Speed: Uvod u optimizaciju performansi web aplikacija ","Description":"\u003cp\u003eSvima je poznat izraz \u0026ldquo;vreme je novac\u0026rdquo;, ali koliko pažnje kao developeri posvećujemo optimizaciji na\u0026scaron;ih web aplikacija? Spore stranice lo\u0026scaron;e utiču čak i na to kako korisnici doživljavaju sadržaj, dizajn i navigaciju tih stranica.\u003c/p\u003e\r\n\r\n\u003cp\u003eOko 80% životnog veka stranice se odvija na front end-u, koji upravo zbog toga treba da bude u na\u0026scaron;em fokusu. Ovo predavanje će vas provesti kroz životni ciklus prosečne web stranice: počev od Http zahteva, preko takozvane \u0026ldquo;vodopad\u0026rdquo; faze, sve do iscrtavanja piksela na monitoru. Proći ćemo kroz načine na koje mozemo ubrzati svaku od ovih faza, kao i kako optimizovati konačnu interakciju korisnika sa tom stranicom.\u003c/p\u003e\r\n"},{"Id":62,"Track":"ALM","DayId":1,"TimeLine":2,"Lang":"English","Level":200,"RoomId":6,"Title":"In-Depth Monitoring and Telemetry with Application Insights","Description":"\u003cp\u003eWriting quality software is hard! You always struggle with deadlines and feature requests. When it is finally done and deployed a whole new set of problems start to happen. Wouldn\u0026#39;t it be nice if you can track how your application is performing in production? Now you can do that! With Visual Studio Online Application Insight you can make sure the application is meeting the performance and availability expectations, analyze the call stack of a faulting function and get usage data for a web pages, Windows Store and Windows Phone apps. This session will go into in depth details and additional tweaks of how Application Insights that you can start using immediately.\u003c/p\u003e\r\n"},{"Id":1051,"Track":"SRV","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":300,"RoomId":7,"Title":"Forefront Identity Manager 2010 Certificate Management - smart kartice u praksi","Description":"\u003cp\u003eImplementacija smart kartica u poslovnim okruženjima, pored internog PKI sistema, zahteva i kvalitetno re\u0026scaron;enje za upravljanje i praćenje životnog toka svake kartice. ForeFront Identity Manager u svom Certificate Management modulu obezbeđuje celovito re\u0026scaron;enje za implementaciju, izdavanje, upravljanje i praćenje kompletnog toka rada svake smart kartice. Ovo predavanje bavi se praktičnom implementacijom\u0026nbsp;i upotrebom ovog proizvoda. Predavanje je namenjeno iskusnijim korisnicima sa dobrim poznavanjem internog PKI-a.\u003c/p\u003e\r\n"},{"Id":1067,"Track":"SRV","DayId":1,"TimeLine":2,"Lang":"Na našem","Level":300,"RoomId":8,"Title":"HOL - Azure IaaS scenariji","Description":"\u003cdiv class=\"info-box yellow\"\u003e\r\n\u003cdiv class=\"msg\"\u003e\r\n\u003cp\u003e\u003cstrong\u003eSve Hand-On Labove možete da radite ceo dan, bez obzira na termine\u003c/strong\u003e\u003c/p\u003e\r\n\u003c/div\u003e\r\n\u003c/div\u003e\r\n\r\n\u003cdiv class=\"space-sep\"\u003e\u0026nbsp;\u003c/div\u003e\r\n\u003cp\u003eVežba u kojoj učesnici\u0026nbsp;koristeći Azure platformu kreiraju nekoliko unapred zadatih scenarija.\u003c/p\u003e\r\n"},{"Id":1064,"Track":"SES","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":200,"RoomId":1,"Title":"1 izazov za 2 godine u 3 zemlje na 4 sharepoint projekta ili Kako sam dao otkaz EU","Description":"\u003cul\u003e\r\n\t\u003cli\u003eIskustva u radu na SharePoint projektima u EU\u003c/li\u003e\r\n\t\u003cli\u003eIzazovi projekata u multikulturalnim sredinama\u003c/li\u003e\r\n\t\u003cli\u003ePoredjenje nacina rada u Svedskoj, Francuskoj i Luksemburgu\u003c/li\u003e\r\n\t\u003cli\u003eOOB SharePoint vs Farm solutions\u003c/li\u003e\r\n\t\u003cli\u003eRumuni u EU\u003c/li\u003e\r\n\t\u003cli\u003ePosebni zahtevi iskusnih klijenata\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003cp\u003eAutor je u proteklih 2.5 godine\u0026nbsp;radio u 3 velike EU institucije (ECDC, ERA i ECA) i ova prezentacija je rezime njegovih iskustava, dilema, problema, uspeha i neuspeha u ovom kratkom ali izuzetno burnom periodu njegovog zivota.\u003c/p\u003e\r\n\r\n\u003cp\u003eDodjite da cujete iz prve ruke, dok su secanja sveza.\u003c/p\u003e\r\n\r\n\u003cp\u003eAutor ce pokusati da na duhovit i razumljiv nacin opise i docara atmosferu koja vlada u EU institucijama, koje su velika sansa nasim IT strucnjacima - pogotovu nakon ulaska Srbije u EU.\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n"},{"Id":1041,"Track":"UX ","DayId":1,"TimeLine":3,"Lang":"English","Level":200,"RoomId":2,"Title":"HACKING THE DESIGN: A Guide to Extraordinary UX for Developers and Other Non-design Folks","Description":"\u003cp\u003eSo you are a true coder ninja, able to build scalable apps (or any digital product for that matter) in your sleep, playing Flappy Bird at the same time. There\u0026rsquo;s just one thing in your way to building that perfect piece of software - you are lacking an eye for design.\u003c/p\u003e\r\n\r\n\u003cp\u003eDebunking the myth that you need some magical \u0026ldquo;feel\u0026rdquo; or superpower to churn out decent looking UIs, this lecture is a simple enough guide that could (and should) be practiced by anyone, regardless of the level of their design skills. WARNING: We will skip the boring theory and jump straight into the colors, alignments, sizes, fonts and animations. These are immediately applicable, track proven tips that will give your app that delightful experience users are craving for. So be brave and get ready for the design.\u003c/p\u003e\r\n"},{"Id":1049,"Track":"CLD","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":300,"RoomId":3,"Title":"Dizajn cloud-based aplikacija korišćenjem pattern-a","Description":"\u003cp\u003eCloud-based apllikacije predstavljaju novi izazov prilikom projektovanja arhitekture softverskih sistema.\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cdiv\u003eProjektovanje arhitekture sistema, između ostalog, \u0026nbsp;podrazumeva dono\u0026scaron;enje odluka, gde svaka odluka ima uticaj na kvalitet, performanse, sigurnost, skalabinost, održivost, a samim tim \u0026nbsp;i uspeh aplikacije.\u003c/div\u003e\r\n\r\n\u003cp\u003eZa razliku od tradicionalnih softverskih sistema, gde se softver izvr\u0026scaron;avao na robusnoj on-premise infrastrukturi, sistemi u cloud-u su globalno distribuirani, na \u0026quot;nepoznatom\u0026quot; hardveru i često zavise od third-party servisa.\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003eSigurnost, dostupnost, brz oporavak, monitoring, performanse, upravljanje itd. samo su neke od kategorija na koje se mora obratiti posebna pažnja prilikom projektovanja cloud-based sistema.\u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003ePredavanje će dati pregled dostupnih pattern-a koji mogu da se koriste u dizajnu aplikacija za cloud, kao i opis procesa modelovanja aplikacija za cloud. \u0026nbsp;\u003c/p\u003e\r\n\r\n\u003cp\u003eSvaki patern će biti opisan preko konkretnog problema koji se re\u0026scaron;ava uz prikladan demo.\u003c/p\u003e\r\n\r\n\u003cp\u003ePaterni koji će biti prikazani (spisak će biti prilagođem vremenu i toku predavanja) su:\u0026nbsp;Runtime Reconfiguration Pattern,\u0026nbsp;Priority Queue Pattern,\u0026nbsp;Circuit Breaker Pattern, Healt Endpoint Monitoring Pattern, Valet Key Pattern, Sharding Pattern,\u0026nbsp;Cache-Aside Pattern.\u003c/p\u003e\r\n\r\n\u003cp\u003ePrikazani paterni nisu ograničeni na cloud-based re\u0026scaron;enja, već se mogu primenjivati i na druge distribuirane sisteme.\u003c/p\u003e\r\n\r\n\u003cp\u003eSvi primeri će biti obrađeni na Windows Azure platformi, ali većina prezentovanih paterna se može koristiti i na drugim platformama.\u003c/p\u003e\r\n"},{"Id":4,"Track":"DVC","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":300,"RoomId":4,"Title":"WP MVVM: Izazovi i rešenja","Description":"\u003cp\u003eDetaljan pregled najče\u0026scaron;ćih izazova iz prakse i najboljih načina za njihovo re\u0026scaron;avanje u razvoju Windows Phone aplikacija koristeći MVVM arhitekturu.\u003c/p\u003e\r\n"},{"Id":35,"Track":"SRV","DayId":1,"TimeLine":3,"Lang":"English","Level":300,"RoomId":5,"Title":"Exchange, Exchange Online \u0026 Something in-between","Description":"\u003cp\u003eExchange 2013 je Microsoft-ov proizvod za elektronsku po\u0026scaron;tu. Proizvod je identičan bilo da se koristi na serverima koje kontroli\u0026scaron;emo mi direktno ili na onima koje Microsoft kontroli\u0026scaron;e kroz Office365.\u003c/p\u003e\r\n\r\n\u003cp\u003eOvo predavanje će u brzim i tehničkim crtama da prođe kroz tri varijante:\u003c/p\u003e\r\n\r\n\u003cul\u003e\r\n\t\u003cli\u003e\u003cstrong\u003e\u003cem\u003eOn-premise\u003c/em\u003e\u003c/strong\u003e - tradicionalna varijanta gde kompanija kontroli\u0026scaron;e ceo sklop - od mreže i opreme, preko operativnog sistema i Active Directory naloga, do Exchange 2013 organizacije, baza i transfera po\u0026scaron;te.\u003c/li\u003e\r\n\t\u003cli\u003e\u003cstrong\u003e\u003cem\u003eExchangeOnline\u003c/em\u003e\u003c/strong\u003e\u0026nbsp;- isti proizvod, ali ovog puta u MS data centrima. Mi i dalje kontroli\u0026scaron;emo naloge i deo mreže, Microsoft kontroli\u0026scaron;e Exchange 2013 servere, baze i transfer po\u0026scaron;te i zajednički kontroli\u0026scaron;emo pristup korisnika.\u003c/li\u003e\r\n\t\u003cli\u003e\u003cstrong\u003e\u003cem\u003eHybrid\u003c/em\u003e\u003c/strong\u003e\u0026nbsp;- me\u0026scaron;ana varijanta gde postoje serveri i u kompaniji i u Office365 data centrima.\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003cp\u003ePredavanje će u 60 minuta da pokrije razlike, sličnosti i relativne prednosti svih varijanti, kao i neke od glavnih poslovnih i tehničkih odluka potrebnih da se napravi dobar izbor jedne od tri opcije.\u003c/p\u003e\r\n"},{"Id":1054,"Track":"APM","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":200,"RoomId":6,"Title":"Kanban i Scrum – koja je dobitna kombinacija?","Description":"\u003cp\u003eIako su i Kanban i Scrum na\u0026scaron;li \u0026scaron;iroku primenu u razvoju dana\u0026scaron;njih informacionih sistema, činjenica je da većina razvojnih timova ima nedoumicu koji pristup da odabere. Ovo predavanje će pružiti dovoljno informacija potrebnih za uspostavljanje procesa rada koji najvi\u0026scaron;e odgovara konkretnim potrebama slu\u0026scaron;alaca. Cilj predavanja je upoznavanje sa osnovnim principima Scrum-a i Kanban-a, kao i njihovo poređenje. Na osnovu toga učesnici će imati dovoljno znanja za dono\u0026scaron;enje odluke koji pristup se prirodnije uklapa u njihovo okruženje, kako da iskoriste najbolje od Scrum-a i Kanban-a, ili pak kako da naprave dobitnu kombinaciju za njihov tim i projekat.\u003c/p\u003e\r\n"},{"Id":1052,"Track":"DBI","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":300,"RoomId":7,"Title":"Columnstore Indexes","Description":"\u003cp\u003eColumnstore indeksi i novi vektorski orijentisani izvr\u0026scaron;ni plan (batch mode) mogu ubrzati izvr\u0026scaron;avanje data warehouse upita od 10 do 100 puta. Sa obzirom na takve performanse, predstavlaju izvanredan izvor informacija za izve\u0026scaron;tajne i analitičke procese. Kroz mno\u0026scaron;tvo primera imaćete priliku da vidite kako je moguće dobiti odgovore iz 100 miliona podataka za par sekundi.\u003c/p\u003e\r\n"},{"Id":1071,"Track":"SRV","DayId":1,"TimeLine":3,"Lang":"Na našem","Level":300,"RoomId":8,"Title":"HOL - Allied Telesis - šta raditi kada otkaže jezgro mreže?","Description":"\u003cdiv class=\"info-box yellow\"\u003e\r\n\u003cdiv class=\"msg\"\u003e\r\n\u003cp\u003e\u003cstrong\u003eSve Hand-On Labove možete da radite ceo dan, bez obzira na termine\u003c/strong\u003e\u003c/p\u003e\r\n\u003c/div\u003e\r\n\u003c/div\u003e\r\n\r\n\u003cdiv class=\"space-sep\"\u003e\u0026nbsp;\u003c/div\u003e\r\n\u003cp\u003eKako se kreira potpuno rezilijentno jezgro mreže otporno na otkaze linkova ili mrežnih uređaja, posle čega ostaje neprekinut saobraćaj u mreži između servera ili Data centra sa jedne i pristupnog segmenta mreža t.j. radnih stanica sa druge strane.\u0026nbsp; Virtual Chassis Stacking tehnologija zajedno sa agregacijom linkova u službi visoke dostupnosti mreže.\u003c/p\u003e\r\n\r\n\u003cp\u003ePraktična demonstracija bi obuhvatila prikaz rezilijentnih tehnologija u izgradnji poslovnih računarskih mreža. Primena ovih tehnologija u poslovnim mrežama, do skora ekskluzivitet samo \u0026ldquo;telco\u0026rdquo; re\u0026scaron;enja, pružaju neophodnu visoku dostupnost mrežne infrastrukture kako u Data centrima tako i u svim poslovnim mrežama kojima je visoka pouzdanost i sigurnost imperativ.\u003c/p\u003e\r\n\r\n\u003cp\u003eO kompaniji:\u003c/p\u003e\r\n\r\n\u003cp\u003eKompanija Allied Telesis, globalni proizvođač IP/Ethernet mrežnih re\u0026scaron;enja i jedna od vodećih učesnika u razvoju \u0026lsquo;Triple Play\u0026rsquo; mreža, i pionira \u0026ldquo;green\u0026rdquo;\u0026nbsp; tehnologija već 25 godina predstavlja lidera u pružanju tehnolo\u0026scaron;kih re\u0026scaron;enja za poslovne mreže. Inovativni proizvodi ove kompanije postavljaju nove standarde u aktuelnim sistemima prenosa i razmene podataka prateći zahteve koje savremene komunikacije postavljaju pred sistem integratore. Visoka dostupnost, pouzdanost i skalabilnost\u0026nbsp; mreža, samo su neke od\u0026nbsp; osnovnih karakteristika koje su obeležje Allied Telesis mrežnih re\u0026scaron;enja.\u003c/p\u003e\r\n"},{"Id":18,"Track":"UX ","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":200,"RoomId":1,"Title":"Dizajn korisničkog iskustva u Windows Phone aplikacijama","Description":"\u003cdiv\u003e\r\n\u003cdiv\u003eRazvoj softvera za mobilne platforme zahteva potpuno nov pristup osmi\u0026scaron;ljavanju i projektovanju korisničkog iskustva (UX), odnosno dizajniranju interakcije sa korisnikom (IxD). Vi\u0026scaron;e nego ikada ranije korisničko iskustvo je to \u0026scaron;to aplikaciju čini uspe\u0026scaron;nom i prihvaćenom od strane publike. Uloga programera u tom procesu postaje sve značajnija, pa je veoma važno puno razumevanje osnovnih postavki, principa i pravila.\u0026nbsp;\u003c/div\u003e\r\n\u003c/div\u003e\r\n"},{"Id":26,"Track":"DVC","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":200,"RoomId":2,"Title":"Windows Embedded 8 Handheld ","Description":"\u003cp\u003e13 Decembra 2013 je bio objava Windows Embedded 8 Handheld SDK, s njim programeri mogu kreirati moderan style aplikacije, koje podržavaju touch scenarios za najnovije industrijskim handheld rugged uređaja.\u003c/p\u003e\r\n\r\n\u003cp\u003eOk, tako kaže Microsoft najava, ali \u0026scaron;to, gdje i kako?\u003c/p\u003e\r\n\r\n\u003cp\u003eU ovoj predavanje ćemo vidjeti \u0026scaron;to donosi novo Windows Embedded 8 Handheld operativni sustav, sa \u0026scaron;to i kako se to programira. Naravno ćemo i poku\u0026scaron;ati uraditi i nekoliko aplikacije, da vidimo kao prvo da nije te\u0026scaron;ko, i kao drugo da vidimo nekoliko stvari na koje treba da pazimo kad pravimo WEH 8 aplikacije.\u003c/p\u003e\r\n"},{"Id":34,"Track":"SES","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":300,"RoomId":3,"Title":"Sloboda za Office 365 podatke! (Klijentski O365 .NET API-ji)","Description":"\u003cp\u003ePrezentacija pokriva mnoge aspekte rada sa API-jima dostupnim za razvoj \u0026#39;eksternih\u0026#39; aplikacija koje koriste Office 365 servise:\u003c/p\u003e\r\n\r\n\u003cul\u003e\r\n\t\u003cli\u003eKako izabrati odgovarajući API\u003c/li\u003e\r\n\t\u003cli\u003eSharePoint Online: SharePoint client object model (CSOM)\u003c/li\u003e\r\n\t\u003cli\u003eSkyDrive Pro\u003c/li\u003e\r\n\t\u003cli\u003eExchange Online: pristup e-mail porukama, objektima u kalendaru i kontaktima - koristeći Exchange Web Services (EWS) Managed API\u0026nbsp;\u003c/li\u003e\r\n\t\u003cli\u003eAutorizacija (OAuth2 kod Office 365 Online)\u003c/li\u003e\r\n\t\u003cli\u003eKako se boriti sa ograničenjima servisa\u003c/li\u003e\r\n\t\u003cli\u003eKako zaokružiti Dev/Test priču uz pomoć TFS Online i Windows Azure\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003cp\u003eDemo: Tehnike i iskustva stečena radom na realnom projektu.\u003c/p\u003e\r\n"},{"Id":21,"Track":"DBI","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":300,"RoomId":4,"Title":"Da li ste spremni za Big Data?","Description":"\u003cp\u003eTrend poznat kao \u0026quot;eksplozija podataka\u0026quot; je odavno počeo tako da pojam Big Data vi\u0026scaron;e ne predstavlja novost. Sve je vi\u0026scaron;e projekata u kojima se zahteva prikupljanje, skladi\u0026scaron;tenje i analiza podataka koji potiču iz izvora koji se ne nalaze pod direktnom kontrolom organizacije za koju radimo. Poslovni korisnici, u cilju dono\u0026scaron;enja kvalitetnijih odluka, zahtevaju mogućnost uvida u informacije sa socijalnih mreža ili iz globalnih i javno dostupnih izvora podataka. Kroz primere i demonstracije kori\u0026scaron;ćenjem besplatnog razvojnog okruženja jednog od Microsoft partnera u domenu Big Data, kompanije Hortonworks, saznajte kako možemo da iskoristimo ovo okruženje za edukaciju i pripremu za dolazeće Big Data projekte kao i \u0026scaron;ta je to Apache Hadoop framework i koje su to tehnologije i alati koje će nam pomoći u dostizanju cilja. Saznajte i kako možete da pristupate podacima iz okruženja zasnovanog na Apache Hadoop i da ih integri\u0026scaron;ete u postojeće DWH/BI okruženje kori\u0026scaron;ćenjem Microsoft SQL Server razvojnih alata i tehnologija.\u003c/p\u003e\r\n"},{"Id":1058,"Track":"APM","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":400,"RoomId":5,"Title":"Partnerstvo Project Managera i Business Analitičara","Description":"\u003cp\u003eOvo je jedan od ključnih faktora uspeha projekta. Prečesta je praksa da se business analiza u IT projektima smatra usputnom stavkom koja će se raditi \u0026bdquo;onako, u toku samog projekta\u0026ldquo;. Nikako se njoj ne daje adekvatno pravo građanstva u projektu. Samim tim, uloga business analitičara je neretko podcenjena, a upravo on i njegov tim su presudni za celi niz uspe\u0026scaron;nih ili neuspe\u0026scaron;nih elemenata koji će se kasnije de\u0026scaron;avati u projektu. Kako definisati ovo partnerstvo? Kako ustanoviti to partnerstvo u jednoj osobi koja je istovremeno i PM i BA?\u003c/p\u003e\r\n"},{"Id":23,"Track":"SRV","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":300,"RoomId":6,"Title":"Offline servisiranje Hyper-V virtualnih servera","Description":"\u003cp\u003eSvima koji su koristili Virtual Machine Manager je poznato da se uz par klikova iz templejta\u0026nbsp;moze kreirati virtualni server koji je prakticno spreman za produkciju. Na ovom predavanju cemo objasniti kako da uz pomoc besplatnih Microsoft alata sami kreiramo templejte, i zatim\u0026nbsp;da od\u0026nbsp;templejta\u0026nbsp;kreiramo novu virtualnu masinu sa preinstaliranim rolama ili featurima,\u0026nbsp;a da pritom imamo potpunu kontrolu nad celim procesom.\u003c/p\u003e\r\n\r\n\u003cp\u003eTakodje cemo demonstrirati kako da na offline virtualnoj masini ili Windows image primenimo hotfixove\u0026nbsp;i Hyper-V integration servise, tako da nova virtualna masina vec nakon prvog\u0026nbsp;startovanja bude potpuno funkcionalna.\u003c/p\u003e\r\n"},{"Id":1037,"Track":"WEB","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":300,"RoomId":7,"Title":"Testing your SPA","Description":"\u003cp\u003eSo, you\u0026#39;ve made the ferpect Single Page Application. It has all the bells and whistles, and uses all the flashing new frameworks.\u003c/p\u003e\r\n\r\n\u003cp\u003eBut how do you know it works, and how do you know that it will continue to work in this world of continuous delivevery? This session will try to explain how to do end-to-edn testing of the system, how to test the application server code, and how to test the code the executes on the client.\u003c/p\u003e\r\n"},{"Id":1072,"Track":"DVC","DayId":1,"TimeLine":4,"Lang":"Na našem","Level":200,"RoomId":8,"Title":"HOL: Building Windows 8.1 App","Description":"\u003cdiv class=\"info-box yellow\"\u003e\r\n\u003cdiv class=\"msg\"\u003e\r\n\u003cp\u003e\u003cstrong\u003eSve Hand-On Labove možete da radite ceo dan, bez obzira na termine\u003c/strong\u003e\u003c/p\u003e\r\n\u003c/div\u003e\r\n\u003c/div\u003e\r\n\r\n\u003cdiv class=\"space-sep\"\u003e\u003cbr /\u003e\r\n\u0026nbsp;\u003c/div\u003e\r\n\r\n\u003cp\u003eKroz devet praktičnih vežbi polaznici će imati priliku da se upoznaju sa programiranjem modernih Windows aplikacija.\u003cbr /\u003e\r\nPonuđene su sledeće vežbe:\u003c/p\u003e\r\n\r\n\u003cul\u003e\r\n\t\u003cli\u003eCreating a Windows Store App\u003c/li\u003e\r\n\t\u003cli\u003eViews: Responsive Design and Semantic Zoom\u003c/li\u003e\r\n\t\u003cli\u003eSearching and Sharing\u003c/li\u003e\r\n\t\u003cli\u003eProcess Lifetime Management\u003c/li\u003e\r\n\t\u003cli\u003eSettings and Preferences\u003c/li\u003e\r\n\t\u003cli\u003eTiles and Notifications\u003c/li\u003e\r\n\t\u003cli\u003eUsing the WebView Control\u003c/li\u003e\r\n\t\u003cli\u003eTouch and Pointer Input\u003c/li\u003e\r\n\t\u003cli\u003eHigh Performance GridViews\u003cbr /\u003e\r\n\t\u0026nbsp;\u003c/li\u003e\r\n\u003c/ul\u003e\r\n"},{"Id":1047,"Track":"WEB","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":200,"RoomId":1,"Title":"MVC i jQuery - Saveti i trikovi kako da...","Description":"\u003cp\u003e...va\u0026scaron;u MVC aplikaciju učinite jo\u0026scaron; efikasnijom. Kroz dosta praktičnih primera biće prikazane neke od najkorisnijih funkcionalnosti koje će vam pomoći da va\u0026scaron;a re\u0026scaron;enja budu kvalitetnija. Biće prikazana manipulacija DOM elementima, event-i, AJAX pozivi, JSON, drop down liste, kalendar i drugo.\u003c/p\u003e\r\n"},{"Id":1042,"Track":"DYN","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":200,"RoomId":2,"Title":"Zašto je Dynamics NAV 2013 najbolji ERP za male i srednje firme","Description":"\u003cp\u003eNa prezentaciji ćete saznati za\u0026scaron;to je Dynamics NAV 2013 najbolji ERP za male i srednje firme. Prezentacija je otvorena za aktivnu diskusiju i razmenu mi\u0026scaron;ljenja.\u003c/p\u003e\r\n"},{"Id":36,"Track":"UX ","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":100,"RoomId":3,"Title":"Govori tiho i nosi svesku sa sobom","Description":"\u003cp\u003eDa li je moguće promeniti tradicionalnu nepodno\u0026scaron;ljivost između dizajnera i developera? Moje je mi\u0026scaron;ljenje da jeste, ali je potrebno da obe strane promene način komunikacije.\u003c/p\u003e\r\n\r\n\u003cp\u003eDeveloperi, dizajneri nisu samo mazala, dozvolite im da vam to i dokažu.\u003c/p\u003e\r\n\r\n\u003cp\u003eDizajneri, developeri nisu samo code monkeys, dozvolite im da vam pomognu da dizajnirate bolje proizvode.\u003c/p\u003e\r\n"},{"Id":24,"Track":"DBI","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":300,"RoomId":4,"Title":"Fizički dizajn dimenzionih baza podataka  na MS SQL Server 2012 ","Description":"\u003cp\u003eDimenziono modelovanje predstavlja koncept i skup tehnika u izradi DW sistema. \u0026nbsp;Krajnji rezultat predstavlja \u0026nbsp;dimenzioni model baze podataka koji se specifičan i konceptualno se razlikuje od ER modela. Ovako kreirane dimenzione baze koriste se za ad hoc analize od strane poslovnih analitičara pomoću različitih BI alata i moraju biti napravljene da imaju veliku brzinu čitanje ogromne količine podataka.\u003c/p\u003e\r\n\u003cp\u003eNa ovom predavanju biće prikazani koncepti dimenzionog modela, smernice u fizičkom dizajnu tabela zavisno od tipa dimenzionih i fakt tabela, kao i smernice u dizajnu ETL-a. Takođe biće pokazani primeri kako koristiti: indekse, particionisanje, kompresiju, ...\u003c/p\u003e\r\n"},{"Id":7,"Track":"SRV","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":300,"RoomId":5,"Title":"Projekat Sinergija portala www.mssinergija.net","Description":"\u003cp\u003e\u003ca href=\"http://www.mssinergija.net\"\u003ewww.mssinergija.net\u003c/a\u003e\u003c/p\u003e\r\n\r\n\u003cp\u003eProjekat koje je organizovan u saradnji sa Microsoft Srbija kancelariom.Zapocet je\u0026nbsp;krajem 2009 i pocetkom 2010 sporveden u delo. Izdrzao je sve Sinegije do danas. Nastvlja da zivi dalje u pripremi za novu Sinergiju 14.\u003c/p\u003e\r\n\r\n\u003cp\u003eVirtuelno resenje koje odoleva vremenu. Pouke i zakljuci dobijeni kroz praksu.\u003c/p\u003e\r\n\r\n\u003cp\u003eKako je nekada izgledalo kako sada izgleda i sta se sprema za buducnost.\u003c/p\u003e\r\n\r\n\u003cp\u003eMogucnosti koje su se pojavile sa novim operativnim sistemmima Windows Server 2012 R2 na polju virtuelizacije koje se mogu primeniti u okviru ovog projekta.\u003c/p\u003e\r\n"},{"Id":1061,"Track":"ALM","DayId":1,"TimeLine":5,"Lang":"English","Level":200,"RoomId":6,"Title":"How to leverage  your SharePoint development with Visual Studio Online ","Description":"\u003cp dir=\"ltr\"\u003eYou develop SharePoint applications, but you do not have the time to mount a TFS infrastructure and manage it : Visual Studio Online is for you.\u003c/p\u003e\r\n\r\n\u003cp dir=\"ltr\"\u003eCode repository, agile methodology, testing, coupled with Visual Studio 2013, in this session you will discover how Visual Studio Online will be the best partner for your SharePoint development.\u003c/p\u003e\r\n\r\n\u003ch4\u003eDemos:\u003c/h4\u003e\r\n\r\n\u003cul dir=\"ltr\"\u003e\r\n\t\u003cli\u003edefinition of an Agile sprint from a SharePoint scenario (dev custom)\u003c/li\u003e\r\n\t\u003cli\u003eUsing Visual Studio 2013 with Visual Studio Online\u003c/li\u003e\r\n\t\u003cli\u003ecode repository management\u003c/li\u003e\r\n\t\u003cli\u003eBuilds management\u003c/li\u003e\r\n\t\u003cli\u003eManage and run tests and test plans\u003c/li\u003e\r\n\u003c/ul\u003e\r\n"},{"Id":10,"Track":"DVC","DayId":1,"TimeLine":5,"Lang":"Na našem","Level":200,"RoomId":7,"Title":"Windows Phone 8.1 - Ready to take your app to the next level?","Description":"\u003cp\u003eNovine u novoj verziji Windows Phone 8.1.\u003c/p\u003e\r\n"},{"Id":1070,"Track":"MSC","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":300,"RoomId":1,"Title":"Internet of Things","Description":"\u003cp\u003eInternet of Things is a difficult trend to define precisely. There is no standard definition for the Internet of Things.\u003c/p\u003e\r\n\r\n\u003cp\u003eSome defines IoT as \u0026ldquo;The network of physical objects that contain embedded technology to communicate and interact with their internal states or the external environment.\u0026rdquo;\u003c/p\u003e\r\n\r\n\u003cdiv\u003eConceptually, IoT involves common principles:\u003c/div\u003e\r\n\r\n\u003col\u003e\r\n\t\u003cli\u003ePhysical \u0026ldquo;things\u0026rdquo; such as devices and sensors that have the ability to connect to the internet\u003c/li\u003e\r\n\t\u003cli\u003eThese things have the ability to collect and communicate information \u0026ndash; this information may include data collected from the environment or inputted by users\u003c/li\u003e\r\n\t\u003cli\u003eThese things also have the ability to take inputs from external sources (human or machine) using embedded logic \u0026ndash; this can include settings, configurations, software updates, etc.\u003c/li\u003e\r\n\u003c/ol\u003e\r\n\r\n\u003cp\u003eCome to see why you as a Dev or ITPro should care about, and what Cortana, Titanfall or Contre Jour have with that:)\u003c/p\u003e\r\n"},{"Id":1065,"Track":"UX ","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":100,"RoomId":2,"Title":"skinScan aplikacija - od wireframe-a do finalnog proizvoda","Description":"\u003cp\u003eskinScan je aplikacija za rano otkrivanje raka kože. Korisnicima omogućava da se lako povežu sa lekarom, urade analizu mladeža i na taj način prepoznaju prve simptome raka kože. Prezentacija prati put razvoja UX/UI dizajna aplikacije od prvih nacrta preko nekoliko radnih verzija do finalne verzije aplikacije, sa osvrtom na probleme razvoja kao i re\u0026scaron;enja istih.\u003c/p\u003e\r\n"},{"Id":8,"Track":"DYN","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":300,"RoomId":3,"Title":"NAV2013R2 \u0027on\u0027 Azure","Description":"\u003cp\u003eJedna od najzanačajnijih novina u najnovijoj verziji Microsoft Dynamics NAV 2013 R2 je mogućnost potpune podr\u0026scaron;ke za Windows Azure. Uvođenjem multi-tenancy okruženja u Microsoft Dynamics\u0026nbsp;NAV, pojavila se mogućnost ponovljivosti projekata implementacije ERP-a na cloudu.\u003c/p\u003e\r\n\r\n\u003cp\u003eU svetu se migracija ERP-a na cloud okruženje sreće sve če\u0026scaron;će, ali kod nas je u povoju. S obzirom na dostupnu tehnologiju i procenu ulaganja, ovo je pravi trenutak za migraciju na Windows Azure ili barem razmi\u0026scaron;ljanje na ovu temu.\u003c/p\u003e\r\n\r\n\u003cp\u003eInstalacija Microsoft Dynamics NAV 2013 R2 na Windows Azure se ne vr\u0026scaron;i na identičan način kao i u lokalnom okruženju. Postoje alati koji se uz određenu modifikaciju mogu iskoristiti da se ovaj postupak prilično automatizuje i olak\u0026scaron;a. Na ovom predavanju ćemo proći razne scenarije kako se NAV može postaviti na Windows Azure, kako se istim može jednostavno upravljati i kako ga koristiti u praksi.\u003c/p\u003e\r\n\r\n\u003cp\u003ePredavanje će teorijski obraditi sve postupke, ali ćemo dobar deo tuh postupaka izvoditi i na praktičnim primerima.\u003c/p\u003e\r\n"},{"Id":33,"Track":"ALM","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":300,"RoomId":4,"Title":"Kreiranje test okruženja uz pomoć Windows PowerShell-a","Description":"\u003cp\u003eWindows 8/8.1 doneli su sa sobom dugo priželjkivanu novinu--Client Hyper-V. Dodajmo tome i novu verziju Windows PowerShell-a i odjednom postaje lako, i zabavno, automatizovati kreiranje test okruženja. Moguće je konvertovati ISO u VHD(X) datoteku, konfigurisati mrežu, kreirati virtuelne ma\u0026scaron;ine i dodati ih u testni domen u samo par linija Windows PowerShell-a. Pridružite nam se da vidite kako se od ISO datoteke do testnog domena stiže u manje od 30 minuta.\u003c/p\u003e\r\n"},{"Id":13,"Track":"DEV","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":300,"RoomId":5,"Title":"Unapređivanje testabilnosti kroz dizajn klasa","Description":"\u003cp\u003eAutomatski testovi su korisnici klasa. Ako testove pi\u0026scaron;emo pre produkcionog koda, onda oni čak postaju prvi korisnici, pre nego \u0026scaron;to ostali produkcioni kod dođe u kontakt sa klasama. Interfejs klase koji promovi\u0026scaron;e jednostavnu interakciju takođe je i jednostavniji za testiranje. Isto važi i za implementaciju podeljenu u manje funkcionalnosti. Posledica dizajna usmerenog ka jednostavnijem testiranju je i da kod koji nastaje kasnije dolazi u kontakt sa klasama sa kojima je lak\u0026scaron;e razmenjivati podatke i čija funkcionalnost lak\u0026scaron;e može da se razume.\u003c/p\u003e\r\n\r\n\u003cp\u003eNa ovom predavanju pokazaćemo kako težnja ka pojednostavljivanju testova dovodi do usavr\u0026scaron;avanja dizajna klasa. Gre\u0026scaron;ke u dizajnu trenutno postaju vidljive, kada se sretnemo sa te\u0026scaron;koćama da zamislimo jasan test a zatim i nemogućno\u0026scaron;ću da ga lako implementiramo u kodu. Bolji dizajn rađa jednostavnije testove - i obratno, jednostavniji testovi podržavaju težnju ka boljem dizajnu klasa.\u003c/p\u003e\r\n\r\n\u003chr /\u003e\r\n\u003cp\u003eAutomated tests are clients to our classes. In Test Driven Development, tests come to be the first clients to our classes, even before other production code gets in touch with them. Class interface which promotes simple interaction is easier to test. So is the class implementation broken down into smaller features. As a consequence production code which interacts with our classes will enjoy benefits of simple interaction and features that are easier to understand and use.\u003c/p\u003e\r\n\r\n\u003cp\u003eIn this session we will demonstrate the healing influence of tests on design of classes. Mistakes in class interface are instantly magnified by tests as they suddenly become hard to conceive and even harder to code. Better the design, simpler the tests - and vice versa.\u003c/p\u003e\r\n"},{"Id":30,"Track":"SRV","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":200,"RoomId":6,"Title":"Lync Server 2013 ::: Planiranje","Description":"\u003cp\u003ePlaniranje postavljanja Lync Server 2013 u bilo koje okruženje podrazumjeva veoma dobru pripremu i analizu svih informacija prije same instalacije. Pravilnim pristupom u analizi dolazimo do tačnijeg i preciznijeg pregleda svih tro\u0026scaron;kova koji su potrebni da bi se projekta doveo uspje\u0026scaron;no do kraja. Ukoliko sve postavimo kako treba i ako su svi resursi zadovoljeni, implementacija može da počne i da prođe bez glavobolje. Kroz prikaz dva različita scenaria u realnom poslovnom okruženju, koristeći alate Microsofta za planiranje, možete da vidite kako uraditi veoma dobru pripremu za Lync Server okruženje i kako lako napraviti plan implementacije? Nakon prezentacije dobićete dosta jasniju sliku na \u0026scaron;ta sve morate da obratite pažnju u samoj pripremi instalacije Lync Server 2013. \u0026nbsp;\u0026nbsp;\u003c/p\u003e\r\n"},{"Id":22,"Track":"DBI","DayId":1,"TimeLine":6,"Lang":"Na našem","Level":300,"RoomId":7,"Title":"Refaktorisanje Baza Podataka","Description":"\u003cp\u003eRefaktorisanje baza podataka je proces strukturnog i funkcionalnog menjaja dizajna baze podataka bez dodavanja ili oduzimanja funkcionalnosti.\u003c/p\u003e\r\n\r\n\u003cp\u003eRefaktorisanje baze podata zahteva izmene u svim aplikacijama koje pristupaju bazi. Sa povecanjem broja aplikacija koje pristupaju bazi povecava se i kompleksnost procesa refaktorisanja.\u003c/p\u003e\r\n\r\n\u003cp\u003eCilj predavanja je predstavljanje procesa, strategije i metoda refaktorisanja baza podataka kao i postupak refaktorisanja na primerima\u003c/p\u003e\r\n"}],"SessionSpeakerRelations":[{"SpeakerId":28,"SessionId":52},{"SpeakerId":37,"SessionId":25},{"SpeakerId":55,"SessionId":38},{"SpeakerId":1053,"SessionId":1043},{"SpeakerId":32,"SessionId":1043},{"SpeakerId":34,"SessionId":20},{"SpeakerId":15,"SessionId":1066},{"SpeakerId":1052,"SessionId":1066},{"SpeakerId":10,"SessionId":19},{"SpeakerId":7,"SessionId":1068},{"SpeakerId":11,"SessionId":1068},{"SpeakerId":42,"SessionId":54},{"SpeakerId":30,"SessionId":16},{"SpeakerId":1047,"SessionId":1035},{"SpeakerId":1056,"SessionId":1045},{"SpeakerId":61,"SessionId":1039},{"SpeakerId":60,"SessionId":62},{"SpeakerId":25,"SessionId":1051},{"SpeakerId":15,"SessionId":1067},{"SpeakerId":1055,"SessionId":1064},{"SpeakerId":1050,"SessionId":1041},{"SpeakerId":1048,"SessionId":1049},{"SpeakerId":8,"SessionId":4},{"SpeakerId":26,"SessionId":35},{"SpeakerId":1060,"SessionId":1054},{"SpeakerId":1061,"SessionId":1052},{"SpeakerId":1052,"SessionId":1071},{"SpeakerId":22,"SessionId":18},{"SpeakerId":31,"SessionId":26},{"SpeakerId":48,"SessionId":34},{"SpeakerId":36,"SessionId":21},{"SpeakerId":1062,"SessionId":1058},{"SpeakerId":40,"SessionId":23},{"SpeakerId":59,"SessionId":1037},{"SpeakerId":11,"SessionId":1072},{"SpeakerId":8,"SessionId":1072},{"SpeakerId":1058,"SessionId":1047},{"SpeakerId":57,"SessionId":1042},{"SpeakerId":45,"SessionId":36},{"SpeakerId":41,"SessionId":24},{"SpeakerId":12,"SessionId":7},{"SpeakerId":1063,"SessionId":1061},{"SpeakerId":16,"SessionId":10},{"SpeakerId":11,"SessionId":10},{"SpeakerId":1069,"SessionId":1070},{"SpeakerId":11,"SessionId":1070},{"SpeakerId":1071,"SessionId":1070},{"SpeakerId":1057,"SessionId":1065},{"SpeakerId":13,"SessionId":8},{"SpeakerId":46,"SessionId":33},{"SpeakerId":27,"SessionId":13},{"SpeakerId":44,"SessionId":30},{"SpeakerId":39,"SessionId":22}],"Slots":[{"Id":1,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":0,"EndHour":10,"EndMinute":0},{"Id":9,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":30,"EndHour":11,"EndMinute":30},{"Id":17,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":25,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":33,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":30,"EndHour":16,"EndMinute":30},{"Id":41,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":17,"StartMinute":0,"EndHour":18,"EndMinute":0},{"Id":2,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":0,"EndHour":10,"EndMinute":0},{"Id":10,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":30,"EndHour":11,"EndMinute":30},{"Id":18,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":26,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":34,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":30,"EndHour":16,"EndMinute":30},{"Id":42,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":17,"StartMinute":0,"EndHour":18,"EndMinute":0},{"Id":3,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":0,"EndHour":10,"EndMinute":0},{"Id":11,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":30,"EndHour":11,"EndMinute":30},{"Id":19,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":27,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":35,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":30,"EndHour":16,"EndMinute":30},{"Id":43,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":17,"StartMinute":0,"EndHour":18,"EndMinute":0},{"Id":4,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":0,"EndHour":10,"EndMinute":0},{"Id":12,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":30,"EndHour":11,"EndMinute":30},{"Id":20,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":28,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":36,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":30,"EndHour":16,"EndMinute":30},{"Id":44,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":17,"StartMinute":0,"EndHour":18,"EndMinute":0},{"Id":5,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":0,"EndHour":10,"EndMinute":0},{"Id":13,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":30,"EndHour":11,"EndMinute":30},{"Id":21,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":29,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":37,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":30,"EndHour":16,"EndMinute":30},{"Id":45,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":17,"StartMinute":0,"EndHour":18,"EndMinute":0},{"Id":6,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":0,"EndHour":10,"EndMinute":0},{"Id":14,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":30,"EndHour":11,"EndMinute":30},{"Id":22,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":30,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":38,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":30,"EndHour":16,"EndMinute":30},{"Id":46,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":17,"StartMinute":0,"EndHour":18,"EndMinute":0},{"Id":7,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":0,"EndHour":10,"EndMinute":0},{"Id":15,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":30,"EndHour":11,"EndMinute":30},{"Id":23,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":31,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":39,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":30,"EndHour":16,"EndMinute":30},{"Id":47,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":17,"StartMinute":0,"EndHour":18,"EndMinute":0},{"Id":8,"TimeLine":1,"DayId":1,"Type":"Session","StartHour":9,"StartMinute":0,"EndHour":10,"EndMinute":0},{"Id":16,"TimeLine":2,"DayId":1,"Type":"Session","StartHour":10,"StartMinute":30,"EndHour":11,"EndMinute":30},{"Id":24,"TimeLine":3,"DayId":1,"Type":"Session","StartHour":12,"StartMinute":0,"EndHour":13,"EndMinute":0},{"Id":32,"TimeLine":4,"DayId":1,"Type":"Session","StartHour":14,"StartMinute":0,"EndHour":15,"EndMinute":0},{"Id":40,"TimeLine":5,"DayId":1,"Type":"Session","StartHour":15,"StartMinute":30,"EndHour":16,"EndMinute":30},{"Id":48,"TimeLine":6,"DayId":1,"Type":"Session","StartHour":17,"StartMinute":0,"EndHour":18,"EndMinute":0}],"PicturesLocation":"http://tarabica.msforge.net/","Tracks":[{"Id":1,"Description":"","Title":"Application Lifecycle Management","Abbeveration":"ALM","PicturePath":"/Content/Images/tracks/ALM.png"},{"Id":13,"Description":"","Title":"Agile i upravljanje projektima","Abbeveration":"APM","PicturePath":"/Content/Images/tracks/APM.png"},{"Id":2,"Description":"","Title":"Cloud, Azure app Development ","Abbeveration":"CLD","PicturePath":"/Content/Images/tracks/CLD.png"},{"Id":3,"Description":"","Title":"Data Platform \u0026 Business Intelligence","Abbeveration":"DBI","PicturePath":"/Content/Images/tracks/DBI.png"},{"Id":4,"Description":"","Title":"Desktop Languages, Frameworks, Developer Tools ","Abbeveration":"DEV","PicturePath":"/Content/Images/tracks/DEV.png"},{"Id":9,"Description":"","Title":"Windows 8, Windows Phone \u0026 Mobile Services","Abbeveration":"DVC","PicturePath":"/Content/Images/tracks/DVC.png"},{"Id":7,"Description":"","Title":"Dynamics","Abbeveration":"DYN","PicturePath":"/Content/Images/tracks/DYN.png"},{"Id":8,"Description":"","Title":"Game Development","Abbeveration":"GAM","PicturePath":"/Content/Images/tracks/GAM.png"},{"Id":11,"Description":"","Title":"Other","Abbeveration":"MSC","PicturePath":"/Content/Images/tracks/MSC.png"},{"Id":5,"Description":"","Title":"SharePoint, Office 365 \u0026 Enterprise Social","Abbeveration":"SES","PicturePath":"/Content/Images/tracks/SES.png"},{"Id":6,"Description":"","Title":"Windows Server, Networks, Cloud Platform and Modern Datacenter ","Abbeveration":"SRV","PicturePath":"/Content/Images/tracks/SRV.png"},{"Id":12,"Description":"","Title":"Korisnicko iskustvo","Abbeveration":"UX ","PicturePath":"/Content/Images/tracks/UX .png"},{"Id":10,"Description":"","Title":"Web development","Abbeveration":"WEB","PicturePath":"/Content/Images/tracks/WEB.png"}]}